fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
/******************************************************************************
 ** \file hc32_bc35.c
 **
 **  Copyright Fuzhou Internet of Things Open Lab.
 **
 **	 Author :Fiot-lab
 **
 **  DESCRIPTION: This file contains NB Configure and Control.
 **
 ******************************************************************************/
#include "hc32_bc35.h"
#include "hc32_key.h"
#include "hc32_lptimer.h"
#include "hc32_crc.h"
#include "hc32_beep.h"
#include "hc32_se.h"
#include "hc32_eeprom.h"
#include "hc32_battery.h"
#include "hc32_valve.h"
#include "hc32_pcnt.h"

uint8_t gBc35UartRecvBuf[Bc35UartRecvBufMaxSize];//Serial Receive Buff

uint8_t gBc35RecvBuf[Bc35UartRecvBufMaxSize];//NBiot Receive Buff

uint8_t gBc35UartSendBuf[Bc35UartRecvBufMaxSize];//NBiot Send Buff

uint8_t gBc35UserLeakPack[64] = {0};//存储补包的数据

Enum_BC35STATUS gBc35UserPrevStatus = BC35STATUS_NONE;//NBiot Status Init

Enum_BC35STATUS gBc35UserNextStatus = BC35STATUS_NONE;//NBiot Status Init

static char gBc35UserStatusIndex = 0;//NBiot Status Index

int gBc35UserQlwConnectStatus = 0;//NBiot Connect Status

int gBc35UserWaitResponse = 0;//Wait Response 20 Sec

char gBc35UserGetDataStatus = 0;//NBiot Get Data Status Flag

char gBc35UserGetDataError = 0;//NBiot Get Data Error Flag

char gBc35UserSendDataRepetition = 0;//NBiot Send Data to OC.if Send Data Faile,Send Data Repetition.

char gBc35UserSendDataStatus = 0;//NBiot Send Data to OC Status Flag

char u8Nb35SleepStatus = 0;//Nbiot Enter Sleep Status 1:Sleep 0:Normal

boolean_t gBc35UserImmediatelyWarn = 0;//Immediately Warn Mode   0111   3:OverCurrent  2:FanCurrent  1:devicewarn

boolean_t gNormalOverCurrentWarn = 0;//Immediately Warn Mode

char gBc35UserReceiveCmdFromOc = 0;//Receive Cmd From Oc Plat

uint32_t gBc35UserOverCurrentTime = 0;//OverCurrent Check Time

uint32_t gBc35UserConCurrentTime = 30;//ConCurrent Check Time

uint32_t gBc35UserSendDataFrequency = 10;//Send Ok DATA Frequency,MIN:minute

uint32_t gBc35UserLeakPackage = 0;//记录补包数

BC35_DateTime_T gBc35DataTime = {2010, 1, 1, 0, 0, 0, 0};

BC35_Qccid_T gBc35Qccid = {0};

BC35_Nngr_T gBc35Nngr = {0};

BC35_Qimei_T gBc35Qimei = {0};

BC35_Qimsi_T gBc35Qimsi = {0};

BC35_Version_T gBc35Version = {0};

BC35_NueStats_T gBc35NueStats = {0};

BC35_Serv_T gBc35Server = {0};

BC35_Cmd_Parser_T gBc35CmdParser = {0};

BC35_Band_T gBc35Band = {0};

BC35_Dat_Send gBc35Data = {0};

BC35_BcInfo_T gBc35InfoNeighbor = {0};

#ifdef HC32_BC28_SUPPORTS

char gBc28UserWaterDevNum[4] = {0};//Water Device Num addr

static char gBc28UserQlwOcip[4] = {0};

static short gBc28UserQlwPort = 5683;

BC28_NueStats_T gBc28NueStats = {0};

BC28_period_T gBc28period = {0};

#endif
/******************************************************************************
 * Local variable definitions ('static')                                      *
 ******************************************************************************/
volatile static uint8_t u8RxData;
volatile static uint8_t u8TxCnt=0;
volatile static uint16_t u16RxCnt=0;
uint8_t u8OcData[128];
uint16_t gBC35_RX_STA=0;       //接收状态标记

/********************************************************************************
  ** \brief  BC35配置函数
  ** 
  ** @param  null
  ** 
  ** \retval null
******************************************************************************/ 
void HC32_BC35_GPIO(void){
    stc_gpio_cfg_t stcGpioCfg;
    
    ///< 打开GPIO外设时钟门控
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE); 
    
    ///< 端口方向配置
    stcGpioCfg.enDir = GpioDirOut;
    ///< 配置上下拉
    stcGpioCfg.enPu = GpioPuDisable;
    stcGpioCfg.enPd = GpioPdDisable;
    
    ///<  NB Power关闭
    Gpio_SetIO(USER_NBPWR_PORT, USER_NBPWR_PIN);
    ///<  NB RST关闭
    Gpio_ClrIO(USER_NBRST_PORT, USER_NBRST_PIN);
    ///<  NB WAKE关闭
    Gpio_ClrIO(USER_NBWAKE_PORT, USER_NBWAKE_PIN);
	
    ///< GPIO IO  NB Power端口初始化
    Gpio_Init(USER_NBPWR_PORT, USER_NBPWR_PIN, &stcGpioCfg);
    ///< GPIO IO  NB RST端口初始化
    Gpio_Init(USER_NBRST_PORT, USER_NBRST_PIN, &stcGpioCfg);
    ///< GPIO IO  NB WAKE端口初始化
    Gpio_Init(USER_NBWAKE_PORT, USER_NBWAKE_PIN, &stcGpioCfg);

	HC32_NBPWR_Hight();
	
	HC32_NBWAKE_Low();
	
	HC32_NBRST_Low();
	delay1ms(100);
	HC32_NBRST_Hight();	
	delay1ms(100);
	HC32_NBRST_Low();		
}
void HC32_TXRX_Out(void)
{
    stc_gpio_cfg_t stcGpioCfg;
    
    ///< 打开GPIO外设时钟门控
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio, TRUE); 
    
    ///< 端口方向配置
    stcGpioCfg.enDir = GpioDirOut;
    ///< 配置上下拉
    stcGpioCfg.enPu = GpioPuEnable;
    stcGpioCfg.enPd = GpioPdDisable;
    
//    ///< LED关闭
    Gpio_ClrIO(GpioPortD, GpioPin5);
    Gpio_ClrIO(GpioPortD, GpioPin6);
	
//    ///< GPIO IO LED端口初始化
    Gpio_Init(GpioPortD, GpioPin5, &stcGpioCfg);
    Gpio_Init(GpioPortD, GpioPin6, &stcGpioCfg);
	
	Gpio_WriteOutputIO(GpioPortD,GpioPin5,1);
	Gpio_WriteOutputIO(GpioPortD,GpioPin6,1);	
}
void HC32_BC35_Init(void)
{
    stc_gpio_cfg_t stcGpioCfg;
    stc_uart_cfg_t    stcCfg;

    DDL_ZERO_STRUCT(stcCfg);    
    DDL_ZERO_STRUCT(stcGpioCfg);
    
    Sysctrl_SetPeripheralGate(SysctrlPeripheralGpio,TRUE); //使能GPIO时钟
    Sysctrl_SetPeripheralGate(SysctrlPeripheralUart1,TRUE);///<使能uart1时钟 
	
    ///<TX
    stcGpioCfg.enDir = GpioDirOut;
    Gpio_Init(GpioPortD, GpioPin5, &stcGpioCfg);
    Gpio_SetAfMode(GpioPortD, GpioPin5, GpioAf1);    //PD05 URART1_TX
    
    ///<RX
    stcGpioCfg.enDir = GpioDirIn;
    Gpio_Init(GpioPortD, GpioPin6, &stcGpioCfg);
    Gpio_SetAfMode(GpioPortD, GpioPin6, GpioAf1);    //PD06 URART1_RX	

//    ///<UART Init
    stcCfg.enRunMode        = UartMskMode1;          ///<模式3
    stcCfg.enStopBit        = UartMsk1bit;           ///<1bit停止位
    stcCfg.enMmdorCk        = UartMskOdd;     			 ///<无偶校验
	#ifdef HC32_BC28_SUPPORTS
		stcCfg.stcBaud.u32Baud  = 9600;                ///<波特率9600
	#endif
	#ifdef HC32_L161_SUPPORTS
		stcCfg.stcBaud.u32Baud  = 115200;                ///<波特率115200
	#else
		stcCfg.stcBaud.u32Baud  = 9600;  		
	#endif
    stcCfg.stcBaud.enClkDiv = UartMsk8Or16Div;       ///<通道采样分频配置
    stcCfg.stcBaud.u32Pclk  = Sysctrl_GetHClkFreq(); ///<获取外设时钟(PCLK)频率值
    Uart_Init(M0P_UART1, &stcCfg);                   ///<串口初始化

    ///<UART中断使能	
    Uart_ClrStatus(M0P_UART1,UartRC);                ///<清接收请求
    Uart_ClrStatus(M0P_UART1,UartTC);                ///<清除发送请求
    Uart_EnableIrq(M0P_UART1,UartRxIrq);             ///<使能接收中断
    EnableNvic(UART1_3_IRQn, IrqLevel1, TRUE);       ///<中断使能
		
	Bc35UserStatusInit();

//#ifdef HC32_LOG_SUPPORTS 
//		FIOT_LAB_LOG(LOG_INFO,"NBIOT(TX:PD5 RX:PD6) Baud: %d StopBit:%d MmdorCk:%d\r\n",stcCfg.stcBaud.u32Baud,stcCfg.enStopBit,stcCfg.enMmdorCk);
//#endif
}
void HC32_BC35_Deinit(void)
{
    stc_gpio_cfg_t stcGpioCfg;
    stc_uart_cfg_t    stcCfg;

    DDL_ZERO_STRUCT(stcCfg);    
    DDL_ZERO_STRUCT(stcGpioCfg);
   
    ///<TX
    stcGpioCfg.enDir = GpioDirIn;
    Gpio_Init(GpioPortD, GpioPin5, &stcGpioCfg);
    
    ///<RX
    stcGpioCfg.enDir = GpioDirIn;
    Gpio_Init(GpioPortD, GpioPin6, &stcGpioCfg);
	
    Uart_Init(M0P_UART1, &stcCfg);                    ///<串口初始化
    Uart_DisableIrq(M0P_UART1,UartRxIrq);             ///<使能接收中断    		
    EnableNvic(UART1_3_IRQn, IrqLevel1, FALSE);       ///<中断使能
}
/********************************************************************************
  ** \brief  UART1中断服务函数
  ** 
  ** @param  null
  ** 
  ** \retval null
******************************************************************************/ 
void Uart1_IRQHandler(void)
{
    if(Uart_GetStatus(M0P_UART1, UartRC))         //UART1接收状态
    {
        Uart_ClrStatus(M0P_UART1, UartRC);        //清除接收标志
		gBc35UartRecvBuf[u16RxCnt++] = M0P_UART1->SBUF_f.DATA;
		if(u16RxCnt >= (Bc35UartRecvBufMaxSize-1)) u16RxCnt = 0;				
    }
}
#ifdef HC32_TIMESTAMP_SUPPORTS
/********************************************************************************
  ** \brief  UserDataTimeCheck(时间戳)
  ** 
  ** @param  null
  ** 
  ** \retval Unix Time
******************************************************************************/ 
static unsigned int Bc35UserDataTimeCheck(void){
	
    unsigned char month_day[] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
    unsigned char month_day_leap[] = {31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
		unsigned int monDays[] = {0,31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334};
    unsigned int gSecCount = 0;
		
    if(gBc35DataTime.sec >= 60){
        gBc35DataTime.sec -= 60;
        gBc35DataTime.min++;
    }
    if(gBc35DataTime.min >= 60){
        gBc35DataTime.min -= 60;
        gBc35DataTime.hour++;
    }
    if(gBc35DataTime.hour >= 24){
        gBc35DataTime.hour -= 24;
        gBc35DataTime.day++;
    }
    if((!(gBc35DataTime.year % 4) && (gBc35DataTime.year % 100)) || !(gBc35DataTime.year % 400)){
        if(gBc35DataTime.day > month_day_leap[gBc35DataTime.mouth]){
            gBc35DataTime.day -= month_day_leap[gBc35DataTime.mouth];
            gBc35DataTime.mouth++;
        }
    }else{
        if(gBc35DataTime.day > month_day[gBc35DataTime.mouth]){
            gBc35DataTime.day -= month_day[gBc35DataTime.mouth];
            gBc35DataTime.mouth++;
        }
    }
    if(gBc35DataTime.mouth > 12){
        gBc35DataTime.mouth -= 12;
        gBc35DataTime.year++;
    }
		gSecCount = (gBc35DataTime.year - 1970) * 365 * 24 * 3600 + (monDays[gBc35DataTime.mouth-1] + \
								 gBc35DataTime.day - 1) * 24 * 3600 + (gBc35DataTime.hour-8) * 3600 + \
								 gBc35DataTime.min * 60 + gBc35DataTime.sec;
		
		gSecCount += (gBc35DataTime.mouth > 2 && (gBc35DataTime.year % 4 == 0) && \
									(gBc35DataTime.year % 100 != 0 || gBc35DataTime.year % 400 == 0))*24*3600;	//闰月
		
