fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
		gSecCount += ((gBc35DataTime.year - 1970)/4 - (gBc35DataTime.year - 1970)/100 + \
									(gBc35DataTime.year - 1970)/400)*24*3600;		//闰年
		
		#ifdef HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_INFO,"Unix Time:%u\r",gSecCount);
		#endif
    return gSecCount;
}
#endif
/********************************************************************************
  ** \brief  *Bc35UserModule
  ** 
  ** @param  char *buffer, char *RePly
  ** 
  ** \retval 返回查询的地址
******************************************************************************/ 
static char *Bc35UserModule(char *buffer, char *RePly){
    char *p = 0, *p1 = 0;
    if(!RePly) p = buffer;
    else if(0 != (p = strstr(buffer, RePly))){
        p += strlen(RePly);
        if(0 != (p1 = strstr(p, "\r"))) *p1 = 0;
        if(0 != (p1 = strstr(p, "\n"))) *p1 = 0;
        while(*p == ' ') p++;
    }
    return p;
}
/********************************************************************************
  ** \brief  UartIntRecvReset(初始化)
  ** 
  ** @param  null
  ** 
  ** \retval null
******************************************************************************/ 
void UartIntRecvReset(void){
	u16RxCnt = 0;
	memset(gBc35UartRecvBuf, 0, sizeof(gBc35UartRecvBuf));
	memset(gBc35RecvBuf, 0, sizeof(gBc35RecvBuf));
}
/********************************************************************************
  ** \brief  UartIntSend函数(发送数据函数)
  ** 
  ** @param  uint8_t *pBuf, uint32_t gLen
  ** 
  ** \retval null
******************************************************************************/ 
void UartIntSend(uint8_t *pBuf, uint32_t gLen){

		uint32_t t;
		for(t = 0;t < gLen;t++)		//循环发送数据
		{
#ifdef HC32_UART_NB_SUPPORTS
			M0P_UART1->SBUF_f.DATA = pBuf[t];
			while(!Uart_GetStatus(M0P_UART1,UartTC));
			Uart_ClrStatus(M0P_UART1, UartTC);
#else
      LPUart_SendDataIt(M0P_LPUART1, pBuf[t]);
			while(!LPUart_GetStatus(M0P_LPUART1,LPUartTC));
			LPUart_ClrStatus(M0P_LPUART1,LPUartTC);			
#endif
		}	 
}
/********************************************************************************
  ** \brief  Bc35UartUserSend函数(发送AT命令函数)
  ** 
  ** @param  想要发送的AT指令
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/ 
static int Bc35UartUserSend(char *cmd){
    if(cmd && strlen(cmd)){
        memset(gBc35UartSendBuf, 0, sizeof(gBc35UartSendBuf));
        strcpy((char *)gBc35UartSendBuf, cmd);
		UartIntRecvReset();
		UartIntSend(gBc35UartSendBuf, strlen(cmd));
		return 1;
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/ 
static int Bc35UserATSend(void){
    return Bc35UartUserSend(BC35_AT);
}
static int Bc35UserAT(void){
	Bc35UserATSend();
	delay1ms(100);
    memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"OK\r");
			#endif
			return 1;
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT重启命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserRebootSend(void){
		#ifdef HC32_L161_SUPPORTS	
    return Bc35UartUserSend(BC35_REBOOT_CRL);
		#endif
		#ifdef HC32_BC28_SUPPORTS	
    return Bc35UartUserSend(BC28_REBOOT_CRL);	
		#endif	
}
static int Bc35UserReboot(void){
    char *p = 0;
	Bc35UserRebootSend();
	delay1ms(100);
    memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
	#ifdef HC32_L161_SUPPORTS
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_REBOOT_REPLY))){
   
    }
	#endif
	#ifdef HC32_BC28_SUPPORTS
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC28_REBOOT_REPLY))){

    }		
	#endif
    if(p){
		#ifdef	HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_INFO,"REBOOTING OK\r\n");
		#endif			
        return 1;
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT进入SLEEP命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
#ifdef HC32_L161_SUPPORTS
static int Bc35UserEnterSleepSend(uint8_t mode_t){
	if(mode_t == 0)
		//Hibernate2 status
		return Bc35UartUserSend(BC35_SLEEP_WRITE("0"));
	else if(mode_t == 1)
		//Hibernate1 status
		return Bc35UartUserSend(BC35_SLEEP_WRITE("1"));
	else if(mode_t == 2)
		//Sleep2 status
		return Bc35UartUserSend(BC35_SLEEP_WRITE("2"));
	else if(mode_t == 3)
		//Sleep1 status
		return Bc35UartUserSend(BC35_SLEEP_WRITE("3"));
	return 0;
}
int Bc35UserEnterSleep(uint8_t mode_t){
    char *p = 0;
		Bc35UserEnterSleepSend(mode_t);
		delay1ms(50);
    memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		FIOT_LAB_LOG(LOG_DEBUG,"Sleep:%s\r\n",gBc35RecvBuf);
		if(0 != (p = strstr(p, BC35_OK_REPLY))){
				return 1;
		}
    return 0;
}
#endif
/********************************************************************************
  ** \brief  AT获取IMEI命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetQimeiSend(void){
    return Bc35UartUserSend(BC35_IMEI_READ);
}
static int Bc35UserGetQimei(void){
    char *p = 0, *p1 = 0;
	if(gBc35Qimei.update == 1)
	{
		#ifdef	HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_INFO,"CGSN:%s\r\n", gBc35Qimei.imei);
		#endif
		return 1;
	}
	Bc35UserGetQimeiSend();
	delay1ms(100);
    memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_IMEI_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_IMEI_REPLY);
        }
    }	
	#ifdef HC32_BC28_SUPPORTS
    if(p && p1 && strlen(p) == 15){
		if(strcmp(p, gBc35Qimei.imei)){
			memset(gBc35Qimei.imei, 0, sizeof(gBc35Qimei.imei));
			strcpy(gBc35Qimei.imei, p);	
			gBc35Qimei.update = 1;
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"CGSN:%s\r\n", gBc35Qimei.imei);
			#endif
			return 1;
		}
	}		
	#endif
	#ifdef HC32_L161_SUPPORTS
    if(p && p1 && strlen(p) == 17){
		sscanf((char *)p,"\"%15s\"",gBc35Qimei.imei);
		gBc35Qimei.update = 1;
		#ifdef	HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_INFO,"CGSN:%s\r\n", gBc35Qimei.imei);
		#endif
		return 1;
    }
	#endif
    return 0;
}
/********************************************************************************
  ** \brief  AT获取临近小区命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetBcInfoSend(void){
    return Bc35UartUserSend(BC35_BCINFO_READ);
}
static int Bc35UserGetBcInfo(void){
    char *p = 0, *p1 = 0;
    int dst[15] = {0};
    unsigned char num = 0, i = 0;
		Bc35UserGetBcInfoSend();
		delay1ms(200);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_BCINFO_REPLY0))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
        }
    }	
		if(p && p1)
		{
			FIOT_LAB_LOG(LOG_INFO, "%s\r", gBc35RecvBuf);
			while(0 != (p = strstr(p, BC35_BCINFO_REPLY1))){
			p += strlen(BC35_BCINFO_REPLY1);
      while(*p == ' '||*p == '\r'||*p == '\n') p++;
			if((0 != (p1 = strstr(p, "\r")))||(0 != (p1 = strstr(p, "\n")))){
					*p1 = 0;
					GetDstAndNumFromStrByCs(p, ",", &num, dst);				
					if(num >= 3){
							gBc35InfoNeighbor.Neighbor[i].Earfcn = atoi(p + dst[0]);
							gBc35InfoNeighbor.Neighbor[i].Pci = atoi(p + dst[1]);
							gBc35InfoNeighbor.Neighbor[i].Rsrp = atoi(p + dst[2]);
							gBc35InfoNeighbor.Neighbor[i].Rsrq = atoi(p + dst[3]);
							#ifdef	HC32_LOG_SUPPORTS
							FIOT_LAB_LOG(LOG_INFO,"Find Neighbor%d Earfcn %d Pci %d Rsrp %d Rsrq %d\r\n", i, gBc35InfoNeighbor.Neighbor[i].Earfcn, \
																																									     gBc35InfoNeighbor.Neighbor[i].Pci, \
																																											 gBc35InfoNeighbor.Neighbor[i].Rsrp, \
																																											 gBc35InfoNeighbor.Neighbor[i].Rsrq);	
							#endif
							i++;
							p = p1 + 1;
							if(i > sizeof(gBc35InfoNeighbor.Neighbor)/sizeof(gBc35InfoNeighbor.Neighbor[0])){
									break;
							}						
						}	
					}
				}
				gBc35InfoNeighbor.NeighborNo = i;
				if(gBc35InfoNeighbor.NeighborNo == 0)
				{
						memset(gBc35InfoNeighbor.Neighbor, 0, sizeof(gBc35InfoNeighbor.Neighbor));
				}
				return 1;
		}
		return 0;
}
/********************************************************************************
  ** \brief  AT获取CCID命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetQccidSend(void){
	#ifdef HC32_L161_SUPPORTS
    return Bc35UartUserSend(BC35_QCCID_READ);
	#endif
	#ifdef HC32_BC28_SUPPORTS
    return Bc35UartUserSend(BC28_QCCID_READ);	
	#endif
}
static int Bc35UserGetQccid(void){
    char *p = 0, *p1 = 0;
	if(gBc35Qccid.update == 1){
		#ifdef	HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_INFO,"CCID:%s\r\n", gBc35Qccid.ccid);
		#endif
		return 1;
	}
	Bc35UserGetQccidSend();
	delay1ms(100);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
	#ifdef HC32_L161_SUPPORTS		
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_QCCID_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_QCCID_REPLY);
        }
    }	
	#endif
	#ifdef HC32_BC28_SUPPORTS
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC28_QCCID_REPLY))){
        if(0 != (p1 = strstr(p, BC28_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC28_QCCID_REPLY);
        }
    }	
	#endif		
    if(p && p1){
        if(strcmp(p, gBc35Qccid.ccid)){
            memset(gBc35Qccid.ccid, 0, sizeof(gBc35Qccid.ccid));
            strcpy(gBc35Qccid.ccid, p);
			gBc35Qccid.update = 1;
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"CCID:%s\r\n", gBc35Qccid.ccid);
			#endif
        }
        return 1;
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT获取IMSI命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetQimsiSend(void){
    return Bc35UartUserSend(BC35_IMSI_READ);
}
static int Bc35UserGetQimsi(void){
    char *p = 0, *p1 = 0;
	if(gBc35Qimsi.update == 1)
	{
		#ifdef	HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_INFO,"IMSI:%s\r\n", gBc35Qimsi.imsi);
		#endif
		return 1;
	}
	Bc35UserGetQimsiSend();
	delay1ms(100);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_OK_REPLY))){
        p = (char *)gBc35RecvBuf;
        while((*p < 0x30)||(*p > 0x39)) p++;
        if(0 != (p1 = strstr(p, "\r"))) *p1 = 0;
        if(0 != (p1 = strstr(p, "\n"))) *p1 = 0;
    }	
    if(p && strlen(p) == 15){
        if(strcmp(p, gBc35Qimsi.imsi)){
            memset(gBc35Qimsi.imsi, 0, sizeof(gBc35Qimsi.imsi));
            strcpy(gBc35Qimsi.imsi, p);
			gBc35Qimsi.update = 1;
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"IMSI:%s\r\n", gBc35Qimsi.imsi);
			#endif
        }
        return 1;
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT获取版本号命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetVerisonSend(void){
	#ifdef HC32_L161_SUPPORTS
    return Bc35UartUserSend(BC35_VERSION_READ);
	#endif
	#ifdef HC32_BC28_SUPPORTS
    return Bc35UartUserSend(BC28_VERSION_READ);	
	#endif
}
static int Bc35UserGetVerison(void){
    char *p = 0, *p1 = 0;
		if(gBc35Version.update == 1){
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"Revision:%s\r\n", gBc35Version.ver);
			#endif
			return 1;
		}
		Bc35UserGetVerisonSend();
		delay1ms(100);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		#ifdef HC32_L161_SUPPORTS
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_VERSION_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_VERSION_REPLY);
        }
    }	
		#endif
		#ifdef HC32_BC28_SUPPORTS
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC28_VERSION_REPLY))){
        if(0 != (p1 = strstr(p, BC28_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC28_VERSION_REPLY);
        }
    }			
		#endif
    if(p && p1){
        if(strcmp(p, gBc35Version.ver)){
            memset(gBc35Version.ver, 0, sizeof(gBc35Version.ver));
            strcpy(gBc35Version.ver, p);
						gBc35Version.update = 1;
						#ifdef	HC32_LOG_SUPPORTS
						FIOT_LAB_LOG(LOG_INFO,"Revision:%s\r\n", gBc35Version.ver);
						#endif
        }
        return 1;
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT获取CEREG状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval Ok or Faile
******************************************************************************/
static int Bc35UserGetCeRegSend(void){
	  return Bc35UartUserSend(BC35_CEREG_READ);
}
static int Bc35UserGetCeReg(void){
    char *p = 0, *p1 = 0;
    int dst[10] = {0};
    unsigned char num = 0;
		Bc35UserGetCeRegSend();
		delay1ms(50);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_CEREG_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_CEREG_REPLY);
        }
		}
    if(p && p1){
			if(0 != (p1 = strstr(p, "+CEREG:"))){
            *p1 = 0;
            p1 += 7;
        }
        GetDstAndNumFromStrByCs(p, ",", &num, dst);		
				if(num == 1)
				{
					char n = atoi(p + dst[0]);
					char stat = atoi(p + dst[1]);
					#ifdef	HC32_LOG_SUPPORTS
					//network stat
					FIOT_LAB_LOG(LOG_INFO,"CEREG:%d,%d\r\n",n,stat);
					#endif
					return 1;
				}
		}
		return 0;
}
/********************************************************************************
  ** \brief  AT获取PSM状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetPsmModeSend(void){
    return Bc35UartUserSend(BC35_CPSMS_READ);
}
static int Bc35UserGetPsmMode(void){
    char *p = 0, *p1 = 0;
	Bc35UserGetPsmModeSend();
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_CPSMS_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_CPSMS_REPLY);
        }
    }	
    if(p && p1){
        if(*p == '0'){
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"PSM:Disable the use of PSM\r");
			#endif
            return 1;
        }else if(*p == '1'){
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"PSM:Enable the use of PSM\r\n");
			#endif
            return 2;
        }else if(*p == '2'){
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"PSM:Disable the use of PSM and discard all parameters for PSM\r\n");	
			#endif					
            return 3;
        }else{
			#ifdef	HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_ERROR,"PSM:Error the use of PSM\r\n");
			#endif
            return 0;
        }
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT设置PSM状态命令函数
  ** 
	** @param  mode 0:Disable the use of PSM
	**         mode 1:Enable the use of PSM
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UerSetPsmModeSend(uint8_t mode_t){
	if(mode_t == 0)
		//Disable the use of PSM
		return Bc35UartUserSend(BC35_CPSMS_WRITE("0"));
	else if(mode_t == 1)
		//Enable the use of PSM
		return Bc35UartUserSend(BC35_CPSMS_WRITE("1"));
	else if(mode_t == 2)
		//Disable the use of PSM and discard all parameters for PSM or,
		//if available, reset to the default values.
		return Bc35UartUserSend(BC35_CPSMS_WRITE("2"));
	return 0;
}
static int Bc35UerSetPsmMode(uint8_t SetPsmMode){
	Bc35UerSetPsmModeSend(SetPsmMode);
	delay1ms(100);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){	
			return Bc35UserGetPsmMode();
    }	
	return 0;
}
static int Bc35UerSetPsmTimeSend(uint8_t time_t){
	
	char buf[36] = {0};
	sprintf(buf,"AT+CPSMS=1,,,01000001,00000001");
	//Disable the use of PSM
	return Bc35UartUserSend(buf);

	//return 0;
}
static int Bc35UerSetPsmTime(uint8_t SetPsmTime){
	Bc35UerSetPsmTimeSend(SetPsmTime);
	delay1ms(100);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){	
			return 1;
    }	
	return 0;
}


/********************************************************************************
  ** \brief  AT获取eDRX状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGeteDRXSend(void){
    return Bc35UartUserSend(BC35_EDRX_READ);
}
static int Bc35UserGeteDRX(void){
    char *p = 0, *p1 = 0;
    int dst[10] = {0};
    unsigned char num = 0;
	Bc35UserGeteDRXSend();
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_EDRX_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_EDRX_REPLY);
        }
    }
	if(p && p1){
		GetDstAndNumFromStrByCs(p, ",\"", &num, dst);	
		if(num == 3){
			char mode = atoi(p + dst[0]);
			short value = (atoi(p + dst[1]) << 2) | atoi(p + dst[2]);
			#ifdef HC32_LOG_SUPPORTS
			//edrx status
			FIOT_LAB_LOG(LOG_INFO,"eDRX:%d,%04d\r\n",mode,value);
			#endif
			return 1;
		}
	}
	return 0;
}
/********************************************************************************
  ** \brief  AT设置eDRX状态命令函数
  ** 
  ** @param  uint8_t mode, uint8_t adt, uint8_t value
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserSeteDRXSend(uint8_t mode, uint8_t adt, uint8_t value){
	if(adt == BC35_EDRX_NBS1)
	{
		if(mode == BC35_EDRX_DISABLE)
			return Bc35UartUserSend(BC35_EDRX_WRITE("0", "5", "0010"));
		else if(mode == BC35_EDRX_ENABLE){
			if(value == BC35_EDRX_20P48SEC){
				return Bc35UartUserSend(BC35_EDRX_WRITE("1", "5", "0010"));				
			}else if(value == BC35_EDRX_40P96SEC){
				return Bc35UartUserSend(BC35_EDRX_WRITE("1", "5", "0011"));			
			}else if(value == BC35_EDRX_81P92SEC){
				return Bc35UartUserSend(BC35_EDRX_WRITE("1", "5", "0101"));			
			}else if(value == BC35_EDRX_163P84SEC){
				return Bc35UartUserSend(BC35_EDRX_WRITE("1", "5", "1001"));			
			}else if(value == BC35_EDRX_327P68SEC){
				return Bc35UartUserSend(BC35_EDRX_WRITE("1", "5", "1010"));			
			}else if(value == BC35_EDRX_655P36SEC){
				return Bc35UartUserSend(BC35_EDRX_WRITE("1", "5", "1011"));			
			}
		}
	}else{	
		#ifdef HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_ERROR,"eDRX AcT-Type is Error!\r\n");	
		#endif
	}
	return 0;
}
static int Bc35UserSeteDRX(uint8_t mode, uint8_t adt, uint8_t value){
	Bc35UserSeteDRXSend(mode, adt, value);
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){	
			return Bc35UserGeteDRX();
    }	
	return 0;	
}
/********************************************************************************
  ** \brief  AT获取Nnmi状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetNnmiSend(void){
    return Bc35UartUserSend(BC28_NNMI_READ);
}
static int Bc35UserGetNnmi(void){
    char *p = 0, *p1 = 0;
	Bc35UserGetNnmiSend();
	delay1ms(100);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC28_NNMI_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC28_NNMI_REPLY);
        }
    }	
    if(p && p1){	
        if(*p == '0'){
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"NNMI:No indications\r\n");
			#endif
            return 1;
        }else if(*p == '1'){
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"NNMI:Indications and message\r\n");
			#endif
            return 2;
        }else if(*p == '2'){
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"NNMI:Indications only\r\n");	
			#endif
            return 3;
        }else{
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_ERROR,"NNMI:Error the use of Indications\r\n");
			#endif
            return 0;
        }
    }
	return 0;
}
/********************************************************************************
  ** \brief  AT设置Nnmi状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserSetNnmiSend(uint8_t SetNnmiMode){
	if(SetNnmiMode == 0)
		//No indications
		return Bc35UartUserSend(BC28_NNMI_WRITE("0"));
	else if(SetNnmiMode == 1)
		//Indications and message
		return Bc35UartUserSend(BC28_NNMI_WRITE("1"));
	else if(SetNnmiMode == 2)
		//Indications only
		return Bc35UartUserSend(BC28_NNMI_WRITE("2"));
	return 0;
}
static int Bc35UserSetNnmi(uint8_t SetNnmiMode){

