fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
	Bc35UserSetNnmiSend(SetNnmiMode);
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){	
		return Bc35UserGetNnmi();
    }	
	return 0;	
}
/********************************************************************************
  ** \brief  AT获取CFUN状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetCfunSend(void){
    return Bc35UartUserSend(BC35_CFUN_READ);
}
static int Bc35UserGetCfun(void){
    char *p = 0, *p1 = 0;
	Bc35UserGetCfunSend();
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_CFUN_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_CFUN_REPLY);
        }
    }
	if(p && p1){
		if(*p == '0'){
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"CFUN:Minimum functionality\r\n");
			#endif
			return 1;
		}else if(*p == '1'){
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"CFUN:Full functionality\r\n");
			#endif
			return 2;
		}else{
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_ERROR,"CFUN:Error the use of functionality\r\n");
			#endif
			return 0;
		}		
	}
	return 0;
}
/********************************************************************************
  ** \brief  AT设置CFUN状态命令函数
  ** 
  ** @param  uint8_t functionality
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserSetCfunSend(uint8_t functionality){
	if(functionality == 0)
		//Minimum functionality
		return Bc35UartUserSend(BC35_CFUN_WRITE("0"));
	else if(functionality == 1)
		//Full functionality
		return Bc35UartUserSend(BC35_CFUN_WRITE("1"));
	return 0;
}
static int Bc35UserSetCfun(uint8_t functionality){
	Bc35UserSetCfunSend(functionality);
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){	
			return Bc35UserGetCfun();
    }	
	return 0;	
}
/********************************************************************************
  ** \brief  AT获取时间状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetDateTimeSend(void){
    return Bc35UartUserSend(BC35_DATE_TIME_READ);
}
static int Bc35UserGetDateTime(void){
    char *p = 0, *p1 = 0;
    int dst[16] = {0};
    unsigned char num = 0;
	stc_rtc_time_t readtime;
	Bc35UserGetDateTimeSend();
	delay1ms(100);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));		
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_DATE_TIME_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_DATE_TIME_REPLY);
        }
    }
    if(p && p1){
		if(0 != (p1 = strstr(p, "+CCLK: "))){
            *p1 = 0;
            p1 += 7;
        }
		#ifdef HC32_L161_SUPPORTS
        GetDstAndNumFromStrByCs(p, "\"/,:+", &num, dst);
		#endif
		#ifdef HC32_BC28_SUPPORTS	
        GetDstAndNumFromStrByCs(p, "/,:+", &num, dst);
		#endif				
		if(num == 8 || num == 6){					
			#ifdef HC32_L161_SUPPORTS
            short year = atoi(p + dst[1]);
            char sec = atoi(p + dst[6]);	
			#endif
			#ifdef HC32_BC28_SUPPORTS	
            short year = atoi(p + dst[0])+2000;
            char sec = atoi(p + dst[5]);	
			#endif					
            if(year >= 2020 && ((sec <= (gBc35DataTime.sec - 1))||(sec >= (gBc35DataTime.sec + 1)))){
                gBc35DataTime.year = year;
				readtime.u8Year = DEC2BCD(gBc35DataTime.year-2000);
				#ifdef HC32_L161_SUPPORTS
                gBc35DataTime.mouth = atoi(p + dst[2]);
				#endif
				#ifdef HC32_BC28_SUPPORTS				
                gBc35DataTime.mouth = atoi(p + dst[1]);
				#endif							
				readtime.u8Month = DEC2BCD(gBc35DataTime.mouth);
				#ifdef HC32_L161_SUPPORTS							
                gBc35DataTime.day = atoi(p + dst[3]);
				#endif
				#ifdef HC32_BC28_SUPPORTS								
                gBc35DataTime.day = atoi(p + dst[2]);
				#endif							
				readtime.u8Day = DEC2BCD(gBc35DataTime.day);
				#ifdef HC32_L161_SUPPORTS								
                gBc35DataTime.hour = atoi(p + dst[4]);
				#endif
				#ifdef HC32_BC28_SUPPORTS		
                gBc35DataTime.hour = atoi(p + dst[3]);
				#endif
                if(p1 && (*p1 == '+')){
                    p1++;
                    gBc35DataTime.hour += atoi(p1);
                }
				#ifdef HC32_L161_SUPPORTS								
                gBc35DataTime.min = atoi(p + dst[5]);
				#endif
				#ifdef HC32_BC28_SUPPORTS								
                gBc35DataTime.min = atoi(p + dst[4]);
				#endif								
				readtime.u8Minute = DEC2BCD(gBc35DataTime.min);
				#ifdef HC32_L161_SUPPORTS									
				gBc35DataTime.zone = atoi(p + dst[7]);
				#endif
				#ifdef HC32_BC28_SUPPORTS									
				gBc35DataTime.zone = atoi(p + dst[6]);
				#endif
				if((gBc35DataTime.zone == 8) || (gBc35DataTime.zone == 32) ){
					gBc35DataTime.hour += 8;
					if(gBc35DataTime.hour >= 24)
						gBc35DataTime.hour -= 24;
				}
				readtime.u8Hour = DEC2BCD(gBc35DataTime.hour);
                gBc35DataTime.sec = sec;
				readtime.u8Second = DEC2BCD(gBc35DataTime.sec);
				if(Rtc_SetTime(&readtime) != Ok){
					#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_ERROR,"RTC Setting IS ERROR\r\n");
					#endif
				}else{
					#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_ERROR,"RTC Time Already Updata\r\n");
					#endif									
				}
				#ifdef HC32_TIMESTAMP_SUPPORTS
                Bc35UserDataTimeCheck();//转成时间戳
				#endif
				#ifdef HC32_LOG_INFO
				FIOT_LAB_LOG(LOG_INFO,"%04d-%02d-%02d %02d:%02d:%02d\r\n",gBc35DataTime.year, gBc35DataTime.mouth, \
																		gBc35DataTime.day, gBc35DataTime.hour,	\
																		gBc35DataTime.min, gBc35DataTime.sec);
				#endif
			}
         return 1;
        }
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT获取band状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetBandSend(void){
	#ifdef HC32_L161_SUPPORTS
    return Bc35UartUserSend(BC35_BAND_READ);
	#endif
	#ifdef HC32_BC28_SUPPORTS
    return Bc35UartUserSend(BC28_BAND_READ);	
	#endif
}
static int Bc35UserGetBand(void){
    char *p = 0, *p1 = 0;
	if(gBc35Band.update == 1){
		#ifdef	HC32_LOG_SUPPORTS
		FIOT_LAB_LOG(LOG_INFO,"NBAND:%s\r\n", gBc35Band.band);
		#endif
		return 1;
	}
	Bc35UserGetBandSend();
	delay1ms(100);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
	#ifdef HC32_L161_SUPPORTS		
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_BAND_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_BAND_REPLY);
        }
	}
	#endif
	#ifdef HC32_BC28_SUPPORTS
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC28_BAND_REPLY))){
        if(0 != (p1 = strstr(p, BC28_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC28_BAND_REPLY);
        }
	}		
	#endif		
    if(p && p1){
		if(strcmp(p, gBc35Band.band)){
				memset(gBc35Band.band, 0, sizeof(gBc35Band.band));
				strcpy(gBc35Band.band, p);
				#ifdef	HC32_LOG_SUPPORTS
				FIOT_LAB_LOG(LOG_INFO,"NBAND:%s\r\n", gBc35Band.band);
				#endif
				gBc35Band.update = 1;
		}
		return 1;			
	}
	return 0;
}
/********************************************************************************
  ** \brief  AT获取CGATT状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetCgattSend(void){
    return Bc35UartUserSend(BC35_CGATT_READ);
}
static int Bc35UserGetCgatt(void){
    char *p = 0, *p1 = 0;
		Bc35UserGetCgattSend();
		delay1ms(50);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_CGATT_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_CGATT_REPLY);
        }
    }	
    if(p && p1){
				if(*p == '1'){
					#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_INFO,"CGATT:1\r\n");
					#endif
					return 1;
				}else if(*p == '0'){
					#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_INFO,"CGATT:0\r\n");	
					#endif
					return 0;
				}else{
					#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_ERROR,"CGATT:error\r\n");
					#endif					
					return 0;
				}
    }
    return 0;
}
/********************************************************************************
  ** \brief  AT设置CGATT状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UerSetCgattSend(uint8_t isAttached){
		if(isAttached == 0)
			//Detached
			return Bc35UartUserSend(BC35_CGATT_WRITE("0"));
		else if(isAttached == 1)
			//Attached
			return Bc35UartUserSend(BC35_CGATT_WRITE("1"));
		return 0;
}
static int Bc35UerSetCgatt(uint8_t isAttached){
		Bc35UerSetCgattSend(isAttached);
		delay1ms(50);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){	
			return Bc35UserGetCgatt();
    }	
		return 0;	
}
/********************************************************************************
  ** \brief  AT修改IMEI状态命令函数
  ** 
  ** @param  需要修改的IMEI
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
int Bc35UserModifyIMEISend(char *str){
	char gSendbuf[64] = {0};
	sprintf(gSendbuf,"AT+ECCGSN=\"IMEI\",\"%s\"\r\n",str);
	if(Bc35UartUserSend(gSendbuf)){
		delay1ms(300);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){
			gBc35Qimei.update = 0;
			return 1;
		}
	}	
	return 0;
}
/********************************************************************************
  ** \brief  AT获取CSQ状态命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetCsqSend(void){
    return Bc35UartUserSend(BC35_CSQ_READ);
}
static int BC35UserGetCsq(void){
    char *p = 0, *p1 = 0;
    int dst[10] = {0};
    unsigned char num = 0;
		Bc35UserGetCsqSend();
		delay1ms(50);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_CSQ_REPLY))){
        if(0 != (p1 = strstr(p, BC35_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC35_CSQ_REPLY);
        }
    }	
    if(p && p1){
        GetDstAndNumFromStrByCs(p, ",", &num, dst);		
				if(num == 1)
				{
					char rssi = atoi(p + dst[0]);
					char ber = atoi(p + dst[1]);
					#ifdef HC32_LOG_SUPPORTS
					//network status
					FIOT_LAB_LOG(LOG_INFO,"CSQ:%d,%d\r\n",rssi,ber);
					#endif
				}				
        return 1;
    }
    return 0;	
}
/********************************************************************************
  ** \brief  AT+ECSTATUS命令解析函数
  ** 
  ** @param  char *buf
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
#ifdef HC32_L161_SUPPORTS
static int Data_parser(char *buf){
	char *p = 0,*p1 = 0;
	uint8_t i = 0;
	char data[][20] = {{"DlEarfcn:"},{"UlEarfcn:"},{"PCI:"},{"Band:"},{"RSRP:"},{"RSRQ:"}, \
									{"SNR:"},{"CeLevel:"},{"DlBler:"},{"UlBler:"},{"DataInactTimerS:"},{"RetxBSRTimerP:"},{"NBMode:\""}};
	
	uint8_t glen = sizeof(data)/20;
	memset(&gBc35NueStats, 0, sizeof(gBc35NueStats));								
	for(i = 0; i <= glen; i++){
		p = strstr((char *)buf, data[i]);
		p += strlen(data[i]);
    if(0 != (p1 = strstr((char *)p, ","))){
		}
		else{
			p1 = strstr((char *)p, "\"");		
		}
		if(p && p1){
			memcpy(gBc35NueStats.DlEarfcn + (i*10), p, p1 - p);
		}else{
			return 0;
		}
	}
	return 1;
}
#endif

/********************************************************************************
  ** \brief  AT+ECSTATUS命令函数
  ** 
  ** @param  null
  ** 
  ** \retval Ok or Faile
******************************************************************************/
#ifdef HC32_L161_SUPPORTS
static int Bc35UserGetNueStatsSend(void){
    return Bc35UartUserSend(BC35_NUESTATS_READ);
}
static int Bc35UserGetNueStatus(void){
    char *p = 0, *p1 = 0, *p2 = 0;
	char tmpbuf[256] = {0};
	Bc35UserGetNueStatsSend();
	delay1ms(500);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_OK_REPLY))){//只处理了PHY数据
				if(0 != (p1 = strstr((char *)gBc35RecvBuf, BC35_NUESTATS_REPLYPHY))){
					if(p && p1){
							p2 = strstr((char *)p1, "\r\n");
							if(p1 && p2){
								p1 += strlen(BC35_NUESTATS_REPLYPHY);
								memcpy((char *)tmpbuf, p1, p2 - p1);
								Data_parser(tmpbuf);
								#ifdef HC32_LOG_SUPPORTS								
								FIOT_LAB_LOG(LOG_DEBUG,"DlEarfcn:%s\r",gBc35NueStats.DlEarfcn);
								FIOT_LAB_LOG(LOG_DEBUG,"UlEarfcn:%s\r",gBc35NueStats.UlEarfcn);
								FIOT_LAB_LOG(LOG_DEBUG,"PCI:%s\r",gBc35NueStats.PCI);
								FIOT_LAB_LOG(LOG_DEBUG,"Band:%s\r",gBc35NueStats.Band);
								FIOT_LAB_LOG(LOG_DEBUG,"RSRP:%s\r",gBc35NueStats.RSRP);
								FIOT_LAB_LOG(LOG_DEBUG,"RSRQ:%s\r",gBc35NueStats.RSRQ);
								FIOT_LAB_LOG(LOG_DEBUG,"SNR:%s\r",gBc35NueStats.SNR);													
								FIOT_LAB_LOG(LOG_DEBUG,"CeLevel:%s\r",gBc35NueStats.CeLevel);
								FIOT_LAB_LOG(LOG_DEBUG,"DlBler:%s\r",gBc35NueStats.DlBler);
								FIOT_LAB_LOG(LOG_DEBUG,"UlBler:%s\r",gBc35NueStats.UlBler);
								FIOT_LAB_LOG(LOG_DEBUG,"DataInactTimerS:%s\r",gBc35NueStats.DataInactTimerS);
								FIOT_LAB_LOG(LOG_DEBUG,"RetxBSRTimerP:%s\r",gBc35NueStats.RetxBSRTimerP);
								FIOT_LAB_LOG(LOG_DEBUG,"NBMode:%s\r",gBc35NueStats.NBMode);
								#endif
					}	
				}
			}
			return 1;
    }	
		return 0;
}
#endif
#ifdef HC32_BC28_SUPPORTS
static int Bc28UserGetNueStatsSend(void){
    return Bc35UartUserSend(BC28_NUESTATS_READ);
}
static int Bc28UserGetNueStatus(void){
    char *p = 0;
	Bc28UserGetNueStatsSend();
	delay1ms(200);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_OK_REPLY))){
		if(0 == strstr((char *)gBc35RecvBuf, "-32768")){		
			if(p){
			memset(&gBc28NueStats,0,sizeof(gBc28NueStats));
			sscanf((char *)gBc35RecvBuf, "\rSignal power:%s\rTotal power:%s\rTX power:%s\rTX time:%s\rRX time:%s\rCell ID:%s\rECL:%s\rSNR:%s\rEARFCN:%s\rPCI:%s\rRSRQ:%s\r", \
		                          gBc28NueStats.Signal_power, gBc28NueStats.Total_power, gBc28NueStats.TX_power, gBc28NueStats.TX_time, gBc28NueStats.RX_time, \
									gBc28NueStats.SCell_ID, gBc28NueStats.ECL, gBc28NueStats.SNR, gBc28NueStats.EARFCN, gBc28NueStats.PCI, gBc28NueStats.RSRQ); 
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_INFO,"Signal Power:%s \r",gBc28NueStats.Signal_power);
			FIOT_LAB_LOG(LOG_INFO,"Total Power:%s \r",gBc28NueStats.Total_power);
			FIOT_LAB_LOG(LOG_INFO,"TX Power:%s \r",gBc28NueStats.TX_power);
			FIOT_LAB_LOG(LOG_INFO,"TX_time:%s \r",gBc28NueStats.TX_time);
			FIOT_LAB_LOG(LOG_INFO,"RX time:%s \r",gBc28NueStats.RX_time);
			FIOT_LAB_LOG(LOG_INFO,"Cell ID:%s \r",gBc28NueStats.SCell_ID);
			FIOT_LAB_LOG(LOG_INFO,"ECL:%s \r",gBc28NueStats.ECL);
			FIOT_LAB_LOG(LOG_INFO,"SNR:%s \r",gBc28NueStats.SNR);
			FIOT_LAB_LOG(LOG_INFO,"EARFCN:%s \r",gBc28NueStats.EARFCN);
			FIOT_LAB_LOG(LOG_INFO,"PCI:%s \r",gBc28NueStats.PCI);
			FIOT_LAB_LOG(LOG_INFO,"RSRQ:%s \r",gBc28NueStats.RSRQ);
			#endif
			}
			return 1;
		}
    }	
	return 0;
}
#endif
/********************************************************************************
  ** \brief  连接华为OC平台命令函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
#ifdef HC_BC35_OCEANCONNECT_SUPPORT
/********************************************************************************
  ** \brief  AT获取南向地址函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserGetQlwServSend(void){
    return Bc35UartUserSend(BC35_NCDP_READ);
}
static int Bc35UserGetQlwServ(void){
    char *p = 0;
    int dst[10] = {0};
    unsigned char num = 0;
	Bc35UserGetQlwServSend();
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_NCDP_REPLY))){
       p = Bc35UserModule((char *)gBc35RecvBuf, BC35_NCDP_REPLY);
    }
	if(p){
	GetDstAndNumFromStrByCs(p, ".,", &num, dst);
		if(num == 6){
			gBc35Server.ippart1 = atoi(p + dst[0]);
			gBc35Server.ippart2 = atoi(p + dst[1]);
			gBc35Server.ippart3 = atoi(p + dst[2]);
			gBc35Server.ippart4 = atoi(p + dst[3]);
			gBc35Server.ipport = atoi(p + dst[4]);
			gBc35Server.lifetime = atoi(p + dst[5]);
			gBc35Server.instance = atoi(p + dst[6]);
			//judge ip address set succeed?
			#ifdef HC32_LOG_SUPPORTS
			//ip address
			FIOT_LAB_LOG(LOG_INFO,"IP ADDRESS:%d.%d.%d.%d:%d,%d,%d\r\n", gBc35Server.ippart1, gBc35Server.ippart2, gBc35Server.ippart3, gBc35Server.ippart4,
																																	gBc35Server.ipport, gBc35Server.lifetime, gBc35Server.instance);
			#endif
			return 1;
		}
	}
	return 0;
}
/********************************************************************************
  ** \brief  AT删除注册信息函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserSetCtm2mERegSend(void){
    return Bc35UartUserSend(BC35_CTM2MEREG_READ);
}
static int Bc35UserSetCtm2mEReg(void){
    char *p = 0, *p1 = 0;
		if(gBc35UserGetDataStatus == 4){
			gBc35UserGetDataStatus = 0;
			return 1;
		}
		Bc35UserSetCtm2mERegSend();
		delay1ms(200);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_OK_REPLY))){
				if(0 != (p1 = strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)))
					if(p && p1)
						return 1;
		}else if(0 != (p = strstr((char *)gBc35RecvBuf, "+CTM2M ERROR: 958"))){//已经删除注册信息
					return 1;
		}
		return 0;
}
/********************************************************************************
  ** \brief  AT设置注册信息函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static int Bc35UserSetCtm2mRegSend(void){
    return Bc35UartUserSend(BC35_CTM2MREG_READ);
}
static int Bc35UserSetCtm2mReg(void){
		if(gBc35UserGetDataStatus == 3){
			gBc35UserGetDataStatus = 0;
			return 1;
		}
		Bc35UserSetCtm2mRegSend();
		delay1ms(200);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		FIOT_LAB_LOG(LOG_DEBUG,"m2mReg:%s\r\n",gBc35RecvBuf);
		if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){//等待注册信息
				return 0;
			}else if(0 != strstr((char *)gBc35RecvBuf, "+CTM2M ERROR:")){//未删除注册信息
				Bc35UserSetCtm2mEReg();
				return 0;
		}
		return 0;
}
/********************************************************************************
  ** \brief  AT设置更新数据信息函数
  ** 
  ** @param  null
  ** 
  ** \retval Ok or Faile
******************************************************************************/
static int Bc35UserSetCtm2mUpDataSend(void){
    return Bc35UartUserSend(BC35_CTM2MUPDATE_READ);
}
static int Bc35UserSetCtm2mUpData(void){
		Bc35UserSetCtm2mUpDataSend();
		delay1ms(100);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		FIOT_LAB_LOG(LOG_DEBUG,"BC35_CTM2MUPDATE_READ:%s\r",gBc35RecvBuf);
		if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){
				return 1;
		}else{
		
