fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
		}
		return 0;
}
/********************************************************************************
  ** \brief  AT设置南向地址函数
  ** 
  ** @param  null
  ** 
  ** \retval Ok or Faile
******************************************************************************/
static int Bc28UserGetQlwServSend(void){
    return Bc35UartUserSend(BC28_NCDP_READ);
}
static int Bc28UserGetQlwServ(void){
    char *p = 0, *p1 = 0;
    int dst[10] = {0};
    unsigned char num = 0;
	Bc28UserGetQlwServSend();
	delay1ms(50);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC28_NCDP_REPLY))){
        if(0 != (p1 = strstr(p, BC28_OK_REPLY))){
            p = Bc35UserModule((char *)gBc35RecvBuf, BC28_NCDP_REPLY);
        }
    }
	if(p && p1){
	GetDstAndNumFromStrByCs(p, ".,", &num, dst);
			if(num == 4){
				gBc35Server.ippart1 = atoi(p + dst[0]);
				gBc35Server.ippart2 = atoi(p + dst[1]);
				gBc35Server.ippart3 = atoi(p + dst[2]);
				gBc35Server.ippart4 = atoi(p + dst[3]);
				gBc35Server.ipport = atoi(p + dst[4]);
				//judge ip address set succeed?
				#ifdef HC32_LOG_SUPPORTS
				//ip address
				FIOT_LAB_LOG(LOG_INFO,"Setting Network Ip Address:%d.%d.%d.%d,%d\r\n", gBc35Server.ippart1, gBc35Server.ippart2, gBc35Server.ippart3, gBc35Server.ippart4, gBc35Server.ipport);
				#endif
				return 1;
			}
	}
	return 0;
}
static int Bc28UserQlwServSend(void){
    char gBc35ServerIps[][16] = {
        //"139.159.140.34",
		"49.4.85.232",
    };
    char tmp[50] = {0};
    #ifdef HC_BC35_OCEANCONNECT_SERVER_IP_SUPPORT
    if((gBc28UserQlwOcip[0] != 0)&&(gBc28UserQlwOcip[1] != 0)&&(gBc28UserQlwOcip[2] != 0)&&(gBc28UserQlwOcip[3] != 0)){
        sprintf(tmp, "AT+NCDP=%d.%d.%d.%d,%d\r\n", gBc28UserQlwOcip[0], gBc28UserQlwOcip[1], gBc28UserQlwOcip[2], gBc28UserQlwOcip[3],gBc28UserQlwPort);
    #ifdef HC_FLASH_SUPPORT
    }else if((gNvData.Ocip[0] != 0)&&(gNvData.Ocip[1] != 0)&&(gNvData.Ocip[2] != 0)&&(gNvData.Ocip[3] != 0)){
        sprintf(tmp, "AT+NCDP=%d.%d.%d.%d,5683\r\n", gNvData.Ocip[0], gNvData.Ocip[1], gNvData.Ocip[2], gNvData.Ocip[3]);
    #endif
    }else{
        sprintf(tmp, "AT+NCDP=%s,5683\r\n", gBc35ServerIps[0]);
    }
    #else
    sprintf(tmp, "AT+NCDP=%s,5683\r", gBc35ServerIps[0]);
    #endif	
	#ifdef HC32_LOG_SUPPORTS
	FIOT_LAB_LOG(LOG_INFO,"%s",tmp);
	#endif
    if(Bc35UartUserSend(tmp)){
		delay1ms(50);
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){						
			return Bc28UserGetQlwServ();
		}
	}
	return 0;
}
/********************************************************************************
  ** \brief  AT发送数据函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
#ifdef HC32_BC28_SUPPORTS
int Bc28UserQlwSendDataSend(uint8_t mesg, uint8_t ctrlcode, uint8_t errorcode, uint8_t secret){
    static char gSendBuf[512] = {0}, buf[512] = {0};
    int gLength = 0;
	float BatteryValue = 0;
	uint16_t u16RefCrc16 = 0;
	
	stc_rtc_time_t readtime;
	uint8_t ret = 0,CtrlCode = ctrlcode;
	uint8_t Secret = secret,ecode = errorcode;
    memset(gSendBuf, 0, sizeof(gSendBuf));
    memset(buf, 0, sizeof(buf));
	memset(&gBc35Data,0,sizeof(gBc35Data));
	
	gBc35Data.Header[0] = 0x36;//固定头 68H
	gBc35Data.Header[1] = 0x38;//固定头 68H
    strcat(buf, gBc35Data.Header);
	ret = Bc35UserGetQimei();
	if(ret != 1) return 0;
	else{
		sprintf(gBc35Data.Imei,"0%s",gBc35Qimei.imei);
		strcat(buf, gBc35Data.Imei);			
	}
	sprintf(gBc35Data.VerCode,"0B");//VERSIONCODE
    strcat(buf, gBc35Data.VerCode);
		
	switch(CtrlCode)
	{
		case DEV_CCODE_METERDATA:
			sprintf(gBc35Data.ConCode,"%02d",DEV_CCODE_METERDATA);//Meter Water CONTROLCODE 01
			break;
		case DEV_CCODE_PHOTODATA://无图片
			sprintf(gBc35Data.ConCode,"%02d",DEV_CCODE_PHOTODATA);//Photo CONTROLCODE 02
			break;
		case DEV_CCODE_PARAMETERDATA://参数码
			sprintf(gBc35Data.ConCode,"%02d",DEV_CCODE_PARAMETERDATA);//PARAMETER CONTROLCODE 03
			break;
		case DEV_CCODE_ALARMDATA://报警码
			sprintf(gBc35Data.ConCode,"%02d",DEV_CCODE_ALARMDATA);//ALARM CONTROLCODE 04
			break;
		case DEV_CCODE_AGAINMETERDATA:
			sprintf(gBc35Data.ConCode,"%02d",DEV_CCODE_AGAINMETERDATA);//AGAINMETER CONTROLCODE 05
			break;
		case DEV_CCODE_AGAINPHOTODATA://无图片
			sprintf(gBc35Data.ConCode,"%02d",DEV_CCODE_AGAINPHOTODATA);//AGAINPHOTO CONTROLCODE 06
			break;
		default://error CONTROLCODE
			sprintf(gBc35Data.ConCode,"%02d",DEV_CCODE_METERDATA);//CONTROLCODE
			break;
	}
    strcat(buf, gBc35Data.ConCode);
		
	//设备名字：666(FIOT(公司编号)) + (MCU唯一标识)DEVUID(9位)		
	sprintf(gBc35Data.Mid,"666%s","123456789");//MID 
    strcat(buf, gBc35Data.Mid);
		
	if(CtrlCode == DEV_CCODE_METERDATA || CtrlCode == DEV_CCODE_PHOTODATA  \
									|| CtrlCode == DEV_CCODE_AGAINMETERDATA){								
										
//		sprintf(gBc35Data.SNR,"%04x",(unsigned char)atoi(gBc28NueStats.SNR));//SNR
		sprintf(gBc35Data.SNR," %04s ",gBc28NueStats.SNR);//SNR											
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.SNR:%s\r",gBc35Data.SNR);	 																	
		strcat(buf, gBc35Data.SNR);
//		sprintf(gBc35Data.RSRP,"%04x",(unsigned short)atoi(gBc28NueStats.Signal_power));//RSRP
		sprintf(gBc35Data.RSRP," %04s ",gBc28NueStats.Signal_power);//RSRP									
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.RSRP:%s\r",gBc35Data.RSRP);																		
		strcat(buf, gBc35Data.RSRP);	
		sprintf(gBc35Data.PCI,"%04x",(unsigned char)atoi(gBc28NueStats.PCI));//PCI
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.PCI:%s\r",gBc35Data.PCI);																		
		strcat(buf, gBc35Data.PCI);	
		sprintf(gBc35Data.ECL,"%02d",(unsigned char)atoi(gBc28NueStats.ECL));//ECL
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.ECL:%s\r",gBc35Data.ECL);																			
		strcat(buf, gBc35Data.ECL);
	}							
	Rtc_ReadDateTime(&readtime);																				
	sprintf(gBc35Data.ReportTime, "%02d%02d%02d%02d%02d%02d",BCD2DEC(readtime.u8Year),BCD2DEC(readtime.u8Month),BCD2DEC(readtime.u8Day), \
														BCD2DEC(readtime.u8Hour),BCD2DEC(readtime.u8Minute),BCD2DEC(readtime.u8Second));//ReportTime		
	strcat(buf, gBc35Data.ReportTime);
			
