fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
	sprintf(gBc35Data.DevId,"%s","01");//Instrument ID 	
	strcat(buf, gBc35Data.DevId);	
	FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.DevId:%2s\r\n",gBc35Data.DevId);	
	
	if(Secret == 1){
		gBc35Data.SecFlag[0] = 0x31;//加密SrcFlag
	}else{
		gBc35Data.SecFlag[0] = 0x30;//不加密SrcFlag		
	}
	sprintf(gBc35Data.SecFlag,"%2s","00");		
	strcat(buf, gBc35Data.SecFlag);	
	FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.SecFlag:%2s\r\n",gBc35Data.SecFlag);	

	gBc35Data.Len[0] = 32;		
	sprintf(gBc35Data.Len,"0%03x",gBc35Data.Len[0]);		
	strcat(buf, gBc35Data.Len);
	FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Len:%2s\r\n",gBc35Data.Len);
	
	sprintf(gBc35Data.Count,"0%s","1");
	strcat(buf, gBc35Data.Count);
	FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Count:%2s\r\n",gBc35Data.Count);		

	HC32_BATTERY_DeInit();
	HC32_BATTERY_Init();		
	BatteryValue = BatteryObtain();	
	if(BatteryValue <= 3.65 && BatteryValue >= 3.3){
		gBc35UserBatteryValueLevel = 3;
	}else if(BatteryValue >= 3.15 && BatteryValue < 3.3){
		gBc35UserBatteryValueLevel = 2;
	}else if(BatteryValue < 3.15 && BatteryValue > 2.8){
		gBc35UserBatteryValueLevel = 1;
		ecode = DEV_ECODE_BATTERY;//Low Vol Warn 
	}else{
		ecode = DEV_ECODE_BATTERY;
		gBc35UserBatteryValueLevel = 0;
	}	

	if(gNormalOverCurrentWarn == 1){// Normal OverCurrent Warn
		ecode = DEV_ECODE_OVERCURRENT;
	}
	
	//Data Field
	switch(ecode)
	{
		case DEV_ECODE_NORMAL:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_NORMAL);//Ecode	Normal 01
			break;
		case DEV_ECODE_BATTERY:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_BATTERY);//Ecode	Battery 02
			break;
		case DEV_ECODE_GAINDATA:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_GAINDATA);//Ecode	Gaindata 03
			break;
		case DEV_ECODE_DEVDESTROY:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_DEVDESTROY);//Ecode	DevDestroy 04
			break;
		case DEV_ECODE_VALVA:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_VALVA);//Ecode	Valva 05
			break;
		case DEV_ECODE_OVERCURRENT:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_OVERCURRENT);//Ecode OverCurrent
			break;
		case DEV_ECODE_CONCURRENT:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_CONCURRENT);//Ecode ConCurrent
			break;
		default:
			sprintf(gBc35Data.Ecode,"%02d",DEV_ECODE_NORMAL);//Ecode	Normal
			break;
	}
	strcat(buf, gBc35Data.Ecode);

	if(CtrlCode == DEV_CCODE_METERDATA){//抄表数据
		gBc35Data.Valve[0] = 0x31;
		sprintf(gBc35Data.Valve, "0%s", gBc35Data.Valve);
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Valve:%s\r",gBc35Data.Valve);	
		strcat(buf, gBc35Data.Valve);
		sprintf(gBc35Data.WaterNum, "%08x", "88088233");
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.WaterNum:%s\r",gBc35Data.WaterNum);			
		strcat(buf, gBc35Data.WaterNum);
		sprintf(gBc35Data.IntervalFlow, "%08x", "50233");	
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.IntervalFlow:%s\r",gBc35Data.IntervalFlow);				
		strcat(buf, gBc35Data.IntervalFlow);
		sprintf(gBc35Data.InverseNum, "%08x", "10000003");
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.InverseNum:%s\r",gBc35Data.InverseNum);				
		strcat(buf, gBc35Data.InverseNum);
		sprintf(gBc35Data.AcquisitionTime, "%02d%02d%02d%02d%02d%02d",gBc35DataTime.year,gBc35DataTime.mouth, \
																		gBc35DataTime.day,gBc35DataTime.hour, \
																		gBc35DataTime.min,gBc35DataTime.sec);	
		strcat(buf, gBc35Data.AcquisitionTime);
		
		sprintf(gBc35Data.Vol, "%04x",(int)(BatteryValue*100));//保留两位数据  x100	
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Vol:%s  %d\r",gBc35Data.Vol, (int)(BatteryValue*100));				
		strcat(buf, gBc35Data.Vol);
		sprintf(gBc35Data.Temperature, "%04x","201");			
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Temperature:%s\r",gBc35Data.Temperature);				
		strcat(buf, gBc35Data.Temperature);		
		sprintf(gBc35Data.Press, "%04x","0");			
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Press:%s\r",gBc35Data.Press);				
		strcat(buf, gBc35Data.Press);	
		sprintf(gBc35Data.Ph, "%04x","80");			
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.PH:%s\r",gBc35Data.Ph);				
		strcat(buf, gBc35Data.Ph);	
		sprintf(gBc35Data.Chlorine, "%04x","300");			
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Chlorine:%s\r",gBc35Data.Chlorine);				
		strcat(buf, gBc35Data.Chlorine);
		sprintf(gBc35Data.Turbidity, "%04x","003");			
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35Data.Turbidity:%s\r",gBc35Data.Turbidity);				
		strcat(buf, gBc35Data.Turbidity);
	}else if(CtrlCode == DEV_CCODE_ALARMDATA){//报警数据
		switch(ecode){
			case DEV_ECODE_DEVDESTROY:
				gBc35Data.DevDestroy[0] = 0x31;
				strcat(buf, gBc35Data.DevDestroy);
				break;
		}
	}
	
	//做CRC校验
	u16RefCrc16 = HC32_CRC16_Get16((uint16_t *)buf, sizeof(buf),16);	
	sprintf(gBc35Data.CRC,"%04x",u16RefCrc16);
	
	strcat(buf, gBc35Data.CRC);
	FIOT_LAB_LOG(LOG_DEBUG, "u16RefCrc16:0x%x CRC:0x%x 0x%x\r\n",u16RefCrc16,gBc35Data.CRC[0],gBc35Data.CRC[1]);
	FIOT_LAB_LOG(LOG_DEBUG, "BUF:%s\r\n",buf);		
	gBc35Data.End[0] = 0X31;//固定 68H
	gBc35Data.End[1] = 0X36;//固定头 68H
	strcat(buf, gBc35Data.End);
	gLength = strlen(buf);		
    sprintf(gSendBuf, "AT+NMGS=%d,%02d%02x", gLength+2, mesg, gLength);
    if(AsciiStrToHexStr(buf, gLength, &gSendBuf[strlen(gSendBuf)], sizeof(gSendBuf) - strlen(gSendBuf))){
		strcat(gSendBuf, "\r\n");
		FIOT_LAB_LOG(LOG_DEBUG, "gSendBuf:%s",gSendBuf);
        if(Bc35UartUserSend(gSendBuf)){				
		delay1ms(1000);
		// be likely to not rec NNMI.
		memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
		FIOT_LAB_LOG(LOG_DEBUG,"gBc35RecvBuf:%s\r\n",gBc35RecvBuf);
		if(0 != strstr((char *)gBc35RecvBuf, BC35_OK_REPLY)){//send ok,start record time
			FIOT_LAB_LOG(LOG_DEBUG,"Send OK to OC \r\n");
			if(u8DeviceWarning == 1)
				u8DeviceWarning = 0;
			else if(u8DeviceAlarm == 1)
				u8DeviceAlarm = 0;	
			else if(u8DeviceOverCurrent == 1)
				u8DeviceOverCurrent = 0;				
			//Start Lptimer
			LpTimer_Enable();
			//Wati 20s Flag
			gBc35UserWaitResponse = 1;	
			//Send Data to OC  succeed, Wait OC Cmd.
			gBc35UserReceiveCmdFromOc = 1;
			//clear time count
			gLptimSecRecord = 0;
			gBc35UserSendDataRepetition++;
			gBc35UserSendDataStatus = 1;
			return 1;
			}				
		}
	}
	return 0;
}
#endif
static uint8_t OceanConnect_cmd_parser(uint8_t *pu8Data, uint16_t u16DataLen){

	uint8_t tmp_state = 0,j = 0;
	char crcbuf[128] = {0};
	uint16_t u16RefCrc16 = 0;
	char tmp[5] = {0};
	char cmptmp[5] = {0};	
	uint16_t i = 1;	//i = 0  是messageID
	
  if ((NULL == pu8Data) || (u16DataLen == NULL)) return 0;

	tmp_state = CMD_PARSER_STATE_Header;//初始状态
	
