fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
	#ifdef HC32_LOG_DEBUG	
	FIOT_LAB_LOG(LOG_DEBUG,"Start Parser!\r");	
	#endif
	
	for (i = 1; i < u16DataLen; i += 2)//两位处理一次
	{
		switch (tmp_state)
		{		
			case CMD_PARSER_STATE_Header:
				if(((pu8Data[i]-48)*10 + (pu8Data[i+1]-48)) == CMD_SYNC_HEADER){
					gBc35CmdParser.Header = CMD_SYNC_HEADER;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Header = 0x%d\r",gBc35CmdParser.Header);
					#endif
					crcbuf[0] = gBc35CmdParser.Header;
					tmp_state = CMD_PARSER_STATE_Version;
				}else{
					tmp_state = CMD_PARSER_STATE_Error;
				}
				break;
			case CMD_PARSER_STATE_Version:
				if(((pu8Data[i]-48)*10 + (pu8Data[i+1]-48)) == CMD_SYNC_VERSION1){
					gBc35CmdParser.AgreementVersion = CMD_SYNC_VERSION1;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find VERSION1 = 0x%02d\r",gBc35CmdParser.AgreementVersion);
					#endif
					crcbuf[1] = gBc35CmdParser.AgreementVersion;
					tmp_state = CMD_PARSER_STATE_Control;
				}else{
					tmp_state = CMD_PARSER_STATE_Error;
				}				
				break;
			case CMD_PARSER_STATE_Control:
				if(((pu8Data[i]-48)*10 + (pu8Data[i+1]-48)) == CMD_SYNC_CONTROLCODE){
					gBc35CmdParser.ControlCode = CMD_SYNC_CONTROLCODE;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find CONTROLCODE = 0x%02d\r",gBc35CmdParser.ControlCode);
					#endif
					crcbuf[2] = gBc35CmdParser.ControlCode;
					tmp_state = CMD_PARSER_STATE_Secret;
				}else{
					tmp_state = CMD_PARSER_STATE_Error;
				}	
				break;
			case CMD_PARSER_STATE_Secret:
				if(((pu8Data[i]-48)*10 + (pu8Data[i+1]-48)) == CMD_SYNC_PULSSECRECT){
					gBc35CmdParser.SecretFlag = CMD_SYNC_PULSSECRECT;//加密,加密处理的协议还未完成
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find SECRECT = 0x%02d\r",gBc35CmdParser.SecretFlag);
					#endif
					crcbuf[3] = gBc35CmdParser.SecretFlag;
					tmp_state = CMD_PARSER_STATE_Lenth;
				}else if(((pu8Data[i]-48)*10 + (pu8Data[i+1]-48)) == CMD_SYNC_NOTSECRECT){
					gBc35CmdParser.SecretFlag = CMD_SYNC_NOTSECRECT;//不加密
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find SECRECT = 0x%02d\r",gBc35CmdParser.SecretFlag);
					#endif
					crcbuf[3] = gBc35CmdParser.SecretFlag;
					tmp_state = CMD_PARSER_STATE_Lenth;
				}
				else{
					tmp_state = CMD_PARSER_STATE_Error;
				}
				break;
			case CMD_PARSER_STATE_Lenth:
				if((gBc35CmdParser.DataLenth = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) <= 9999){
					#ifdef HC32_LOG_DEBUG					
					FIOT_LAB_LOG(LOG_DEBUG,"Find LENTH = 0x%d\r",gBc35CmdParser.DataLenth);
					#endif
					crcbuf[4] = gBc35CmdParser.DataLenth;
					tmp_state = CMD_PARSER_STATE_Data;
					i += 2;
				}else{
					tmp_state = CMD_PARSER_STATE_Error;
				}
				break;
			case CMD_PARSER_STATE_Data:
				//Valve Control
				if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_VALVE){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_VALVE;
					gBc35CmdParser.Data.Valve = (pu8Data[i+4]-48) * 10 + (pu8Data[i+5]-48);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Valve = %d-%d\r",gBc35CmdParser.Data.ControlNum,gBc35CmdParser.Data.Valve);
					#endif
					i += 4;
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Valve;
					tmp_state = CMD_PARSER_STATE_CRC;
				//Send Data Frequency
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_UPDATAFRE){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_UPDATAFRE;
					//gBc35CmdParser.Data.SdataFrequency = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					gBc35UserSendDataFrequency = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Send Data Frequency = %d-%04d\r",gBc35CmdParser.Data.ControlNum,gBc35UserSendDataFrequency);
					#endif
					for(char j = 0; j<4; j += 2){						
						AT24CXX_WriteOneByte(ADDR_DATAFREQUENCY_RECORD+j/2,(pu8Data[i+4+j]-48)*10+(pu8Data[i+4+j+1]-48));
					}				
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.SdataFrequency;
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;
				//Gather Frequency
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_GATHERFRE){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_GATHERFRE;
					gBc35CmdParser.Data.GatherFrequency = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Gather Frequency = %d-%04d\r",gBc35CmdParser.Data.ControlNum,gBc35CmdParser.Data.GatherFrequency);
					#endif
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.GatherFrequency;
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;
				//OvercurrentWarn 
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_OVERCURRENTWARN){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_OVERCURRENTWARN;
					gBc35CmdParser.Data.OvercurrentWarn = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find OvercurrentWarn = %d-%d\r",gBc35CmdParser.Data.ControlNum,gBc35CmdParser.Data.OvercurrentWarn);
					#endif
					for(char j = 0; j<4; j += 2){						
						AT24CXX_WriteOneByte(ADDR_OCURRENTTH_RECORD+j/2,(pu8Data[i+4+j]-48)*10+(pu8Data[i+4+j+1]-48));
					}					
					AT24CXX_Read(ADDR_OCURRENTTH_RECORD,(uint8_t *)tmp,2);					
					SetOverCurrentValue(tmp[0],tmp[1]);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"OVERCURRENTTHRE Num : %02d%02d\r",tmp[0],tmp[1]);
					#endif				
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.OvercurrentWarn;				
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;	
				//OvercurrentTime
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_OVERCURRENTTIME){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_OVERCURRENTTIME;
					//gBc35CmdParser.Data.OvercurrentTime = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					gBc35UserOverCurrentTime = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);					
					for(char j = 0; j<4; j += 2){						
						AT24CXX_WriteOneByte(ADDR_OCURRENTTIME_RECORD+j/2,(pu8Data[i+4+j]-48)*10+(pu8Data[i+4+j+1]-48));
					}					
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find OvercurrentTime = %d-%d \r",gBc35CmdParser.Data.ControlNum,gBc35UserOverCurrentTime);
					#endif					
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.OvercurrentTime;				
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;	
				//ConOvercurrentWarn
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_CYOVERCURRENTWARN){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_CYOVERCURRENTWARN;
					gBc35CmdParser.Data.ConOvercurrentWarn = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					for(char j = 0; j<4; j += 2){						
						AT24CXX_WriteOneByte(ADDR_CCURRENTTH_RECORD+j/2,(pu8Data[i+4+j]-48)*10+(pu8Data[i+4+j+1]-48));
					}	
					AT24CXX_Read(ADDR_CCURRENTTH_RECORD,(uint8_t *)tmp,2);					
					SetOverCurrentValue(tmp[0],tmp[1]);	
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find ConOvercurrentWarn = %d-%d\r",gBc35CmdParser.Data.ControlNum,gBc35CmdParser.Data.ConOvercurrentWarn);
					#endif					
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.ConOvercurrentWarn;				
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;	
				//ConOvercurrentTime
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_CYOVERCURRENTTIME){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_CYOVERCURRENTTIME;
					//gBc35CmdParser.Data.ConOvercurrentTime = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					gBc35UserConCurrentTime = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					for(char j = 0; j<4; j += 2){						
						AT24CXX_WriteOneByte(ADDR_CCURRENTTIME_RECORD+j/2,(pu8Data[i+4+j]-48)*10+(pu8Data[i+4+j+1]-48));
					}									
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find ConOvercurrentTime = %d-%d\r",gBc35CmdParser.Data.ControlNum,gBc35UserConCurrentTime);
					#endif
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.ConOvercurrentTime;					
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + (pu8Data[i+1]-48)*100 + (pu8Data[i+2]-48)*10 + (pu8Data[i+3]-48)) == CMD_CODE_MODIFYSERVER){
					//修改服务器
					gBc35CmdParser.Data.ControlNum = CMD_CODE_MODIFYSERVER;
					#if 0
					gBc35CmdParser.Data.Server.ServerPast1 = (pu8Data[i+4]-48) * 100 + (pu8Data[i+5]-48) * 10 + (pu8Data[i+6]-48); 
					gBc35CmdParser.Data.Server.ServerPast2 = (pu8Data[i+7]-48) * 100 + (pu8Data[i+8]-48) * 10 + (pu8Data[i+9]-48); 
					gBc35CmdParser.Data.Server.ServerPast3 = (pu8Data[i+10]-48) * 100 + (pu8Data[i+11]-48) * 10 + (pu8Data[i+12]-48); 
					gBc35CmdParser.Data.Server.ServerPast4 = (pu8Data[i+13]-48) * 100 + (pu8Data[i+14]-48) * 10 + (pu8Data[i+15]-48); 
					gBc35CmdParser.Data.Server.ServerPort = (pu8Data[i+16]-48) * 1000 + (pu8Data[i+17]-48) * 100 + (pu8Data[i+18]-48) * 10 + (pu8Data[i+19]-48);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Server = %d-%d.%d.%d.%d:%d\r",gBc35CmdParser.Data.ControlNum, gBc35CmdParser.Data.Server.ServerPast1, gBc35CmdParser.Data.Server.ServerPast2, \
																														gBc35CmdParser.Data.Server.ServerPast3, gBc35CmdParser.Data.Server.ServerPast4, gBc35CmdParser.Data.Server.ServerPort);
					#endif				
					#else
				
					gBc28UserQlwOcip[0] = (pu8Data[i+4]-48) * 100 + (pu8Data[i+5]-48) * 10 + (pu8Data[i+6]-48);
					gBc28UserQlwOcip[1] = (pu8Data[i+7]-48) * 100 + (pu8Data[i+8]-48) * 10 + (pu8Data[i+9]-48); 
					gBc28UserQlwOcip[2] = (pu8Data[i+10]-48) * 100 + (pu8Data[i+11]-48) * 10 + (pu8Data[i+12]-48); 
					gBc28UserQlwOcip[3] = (pu8Data[i+13]-48) * 100 + (pu8Data[i+14]-48) * 10 + (pu8Data[i+15]-48); 
					gBc28UserQlwPort = (pu8Data[i+16]-48) * 1000 + (pu8Data[i+17]-48) * 100 + (pu8Data[i+18]-48) * 10 + (pu8Data[i+19]-48);	
					AT24CXX_Write(ADDR_IPSER_RECORD,(uint8_t *)gBc28UserQlwOcip,4);
					AT24CXX_WriteLenByte(ADDR_IPSER_RECORD+4,gBc28UserQlwPort,2);
					
