fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"IP Server Already Store to Flash\r\n");
					#endif
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Server = %d.%d.%d.%d:%d\r\n",gBc28UserQlwOcip[0],gBc28UserQlwOcip[1],gBc28UserQlwOcip[2],gBc28UserQlwOcip[3],gBc28UserQlwPort);
					#endif
					#endif
					//CRC
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.ConOvercurrentTime;					
					i += 18;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_MODIFYSYSTIME){
					//修改时间
					
					gBc35CmdParser.Data.ControlNum = CMD_CODE_MODIFYSYSTIME;
					#if 0
					gBc35CmdParser.Data.Clock.Year = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48)*10 + (pu8Data[i+7]-48); 
					gBc35CmdParser.Data.Clock.Month = (pu8Data[i+8]-48)*10 + (pu8Data[i+9]-48); 
					gBc35CmdParser.Data.Clock.Day = (pu8Data[i+10]-48)*10 + (pu8Data[i+11]-48); 
					gBc35CmdParser.Data.Clock.Hour = (pu8Data[i+12]-48)*10 + (pu8Data[i+13]-48); 
					gBc35CmdParser.Data.Clock.Min = (pu8Data[i+14]-48)*10 + (pu8Data[i+15]-48);			
					gBc35CmdParser.Data.Clock.Sec = (pu8Data[i+16]-48)*10 + (pu8Data[i+17]-48);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Time = %d,%d-%02d-%02d %02d:%02d:%02d\r",gBc35CmdParser.Data.ControlNum, gBc35CmdParser.Data.Clock.Year, gBc35CmdParser.Data.Clock.Month, \
																					gBc35CmdParser.Data.Clock.Day, gBc35CmdParser.Data.Clock.Hour, gBc35CmdParser.Data.Clock.Min, gBc35CmdParser.Data.Clock.Sec);
					#endif				
					#else
					stc_rtc_time_t readtime;
					readtime.u8Year = DEC2BCD((pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48)*10 + (pu8Data[i+7]-48)-2000); 
					readtime.u8Month = DEC2BCD((pu8Data[i+8]-48)*10 + (pu8Data[i+9]-48)); 
					readtime.u8Day = DEC2BCD((pu8Data[i+10]-48)*10 + (pu8Data[i+11]-48)); 
					readtime.u8Hour = DEC2BCD((pu8Data[i+12]-48)*10 + (pu8Data[i+13]-48)); 
					readtime.u8Minute = DEC2BCD((pu8Data[i+14]-48)*10 + (pu8Data[i+15]-48));			
					readtime.u8Second = DEC2BCD((pu8Data[i+16]-48)*10 + (pu8Data[i+17]-48));
					if(Rtc_SetTime(&readtime) != Ok){
						#ifdef HC32_LOG_SUPPORTS
						FIOT_LAB_LOG(LOG_ERROR,"RTC Setting IS ERROR\r\n");
						#endif
					}else{
						#ifdef HC32_LOG_SUPPORTS
						FIOT_LAB_LOG(LOG_ERROR,"RTC Time Already Updata\r\n");
						#endif									
					}				
					#endif

					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Clock.Year;		
					crcbuf[7] = gBc35CmdParser.Data.Clock.Month;	
					crcbuf[8] = gBc35CmdParser.Data.Clock.Day;
					crcbuf[9] = gBc35CmdParser.Data.Clock.Hour;		
					crcbuf[10] = gBc35CmdParser.Data.Clock.Min;	
					crcbuf[11] = gBc35CmdParser.Data.Clock.Sec;					
					i += 16;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_BATTERYTHRELD){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_BATTERYTHRELD;
					gBc35CmdParser.Data.Battery = (pu8Data[i+4]-48) * 1000 + (pu8Data[i+5]-48) * 100 + (pu8Data[i+6]-48) * 10 + (pu8Data[i+7]-48);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Battery = %d-%d\r",gBc35CmdParser.Data.ControlNum,gBc35CmdParser.Data.Battery);
					#endif
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Battery;				
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_MODIFYAPN){
					//未实现修改APN
					gBc35CmdParser.Data.ControlNum = CMD_CODE_MODIFYAPN;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find APN = %d\r",gBc35CmdParser.Data.ControlNum);
					#endif
					//CRC未实现
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Battery;					
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_MODIFYWNUM){
					//Modify Water Num
					gBc35CmdParser.Data.ControlNum = CMD_CODE_MODIFYWNUM;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find Water Num = %d\r",gBc35CmdParser.Data.ControlNum);
					#endif
					for(char j = 0; j<8; j += 2){						
						AT24CXX_WriteOneByte(ADDR_WNUM_RECORD+j/2,(pu8Data[i+4+j]-48)*10+(pu8Data[i+4+j+1]-48));
					}				
					//CRC未实现
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Battery;					
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_WATERAMOUNT){
					char tmp[8] = {0};
					//Modify 水量
					gBc35CmdParser.Data.ControlNum = CMD_CODE_WATERAMOUNT;
					for(char j = 0; j<8; j += 2){						
						AT24CXX_WriteOneByte(ADDR_StorePcnt_START+j/2,(pu8Data[i+4+j]-48)*10+(pu8Data[i+4+j+1]-48));
					}	
					AT24CXX_Read(ADDR_StorePcnt_START,(uint8_t *)tmp,4);
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"CMD_CODE_WATERAMOUNT Num : %02d%02d%02d%02d\r",tmp[0],tmp[1],tmp[2],tmp[3]);
					#endif	
					WaterPcntClear(tmp[0]*100 + tmp[1],tmp[2]*10 + tmp[3]/10);					
					//CRC未实现
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Battery;					
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_IMMEDWARN){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_IMMEDWARN;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find CMD_CODE_IMMEDWARN = %d\r",gBc35CmdParser.Data.ControlNum);
					#endif
					
