fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
					//0111  0000 0001
					AT24CXX_WriteOneByte(ADDR_IMWARN_RECORD,(pu8Data[i+4]-48)<<2 | (pu8Data[i+5]-48)<<1 | (pu8Data[i+6]-48));
					FIOT_LAB_LOG(LOG_DEBUG,"%d\r\n",(pu8Data[i+4]-48) << 2 | (pu8Data[i+5]-48)<<1 | (pu8Data[i+6]-48));
					gBc35UserImmediatelyWarn = (pu8Data[i+4]-48)<<2 | (pu8Data[i+5]-48)<<1 | (pu8Data[i+6]-48);
					
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"CMD_CODE_IMMEDWARN Num : %d\r",gBc35UserImmediatelyWarn);
					#endif	
					
					//CRC未实现
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Battery;					
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;	
				}else if((gBc35CmdParser.Data.ControlNum = ((pu8Data[i]-48)*1000) + ((pu8Data[i+1]-48)*100) + ((pu8Data[i+2]-48)*10) + (pu8Data[i+3]-48)) == CMD_CODE_DENSEPERIOD){
					gBc35CmdParser.Data.ControlNum = CMD_CODE_DENSEPERIOD;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find CMD_CODE_DENSEPERIOD = %d\r",gBc35CmdParser.Data.ControlNum);
					#endif
					
					gBc28period.Year =  DEC2BCD((pu8Data[i+4]-48)*10 + (pu8Data[i+5]-48));
					gBc28period.Month = DEC2BCD((pu8Data[i+6]-48)*10 + (pu8Data[i+7]-48));
					gBc28period.Day = DEC2BCD((pu8Data[i+8]-48)*10 + (pu8Data[i+9]-48));
					gBc28period.Hour =  DEC2BCD((pu8Data[i+10]-48)*10 + (pu8Data[i+11]-48));
					gBc28period.Min = DEC2BCD((pu8Data[i+12]-48)*10 + (pu8Data[i+13]-48));
					gBc28period.PriodStartFlag = 1;//open
					// gBc28period.Sec = (pu8Data[i+16]-48)*10 + (pu8Data[i+17]-48);	
					
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find time for centralized reporting = %d.%d.%d.%d:%d\r",BCD2DEC(gBc28period.Year), BCD2DEC(gBc28period.Month),BCD2DEC(gBc28period.Day), \
																														BCD2DEC(gBc28period.Hour),BCD2DEC(gBc28period.Min));
					#endif					
					//CRC未实现
					crcbuf[5] = gBc35CmdParser.Data.ControlNum;
					crcbuf[6] = gBc35CmdParser.Data.Battery;					
					i += 6;
					tmp_state = CMD_PARSER_STATE_CRC;					
				}else{
					tmp_state = CMD_PARSER_STATE_Error;
				}				
				break;
			case CMD_PARSER_STATE_CRC:
				//CRC 未处理,代码未写
				u16RefCrc16 = HC32_CRC16_Get16((uint16_t *)crcbuf,sizeof(crcbuf), 16);
				sprintf(cmptmp,"%x",u16RefCrc16);	
				for(j = 0;j < 4;j++){
					tmp[j] = pu8Data[i+j];
				}			
				if(strcmp(tmp,cmptmp) == 0){
					#ifdef HC32_LOG_DEBUG
					tmp_state = CMD_PARSER_STATE_End;
					FIOT_LAB_LOG(LOG_DEBUG,"CRC Check Succeed!\r\n");	
					#endif
				}else{
					#ifdef HC32_LOG_DEBUG	
					tmp_state = CMD_PARSER_STATE_Error;
					FIOT_LAB_LOG(LOG_DEBUG,"CRC Check False!\r\n");	
					#endif
				}
				i += 2;
				break;
			case CMD_PARSER_STATE_End:
				if(((pu8Data[i]-48)*10 + (pu8Data[i+1]-48)) == CMD_SYNC_END){
					gBc35CmdParser.End = CMD_SYNC_END;
					tmp_state = CMD_PARSER_STATE_Ok;
					#ifdef HC32_LOG_DEBUG
					FIOT_LAB_LOG(LOG_DEBUG,"Find End = 0x%d\r",gBc35CmdParser.End);
					#endif
				}else{
					tmp_state = CMD_PARSER_STATE_Error;
				}				
				break;
			case CMD_PARSER_STATE_Error:
				#ifdef HC32_LOG_DEBUG	
				FIOT_LAB_LOG(LOG_DEBUG,"Parser Faile!\r");	
				#endif
				i += u16DataLen;//exit
				break;
		}
		if(tmp_state == CMD_PARSER_STATE_Error)
			return 0;
	}
	return 1;
}

#endif
static void Bc35UserStatusInit(void){
	gBc35UserStatusIndex = 0;
    gBc35UserNextStatus = BC35STATUS_NONE;
    gBc35UserPrevStatus = BC35STATUS_NONE;
	Bc35UserATSend();
	//Warn Mode Read IP Serv Configure from Flash.	
	AT24CXX_Read(ADDR_IPSER_RECORD,(unsigned char *)gBc28UserQlwOcip,4);
	gBc28UserQlwPort = AT24CXX_ReadLenByte(ADDR_IPSER_RECORD+4,2);
	if((gBc28UserQlwOcip[0] == 0xFF) && (gBc28UserQlwOcip[1] == 0xFF) && (gBc28UserQlwOcip[2] == 0xFF) && (gBc28UserQlwOcip[3] == 0xFF)){
		memset(gBc28UserQlwOcip, 0, sizeof(gBc28UserQlwOcip));
		#ifdef HC32_LOG_INFO
		FIOT_LAB_LOG(LOG_INFO,"IP Server Default Setting\r\n");
		#endif		
	}else{
		#ifdef HC32_LOG_INFO
		FIOT_LAB_LOG(LOG_INFO,"IP Server : %d.%d.%d.%d:%d\r\n",gBc28UserQlwOcip[0],gBc28UserQlwOcip[1],\
														   gBc28UserQlwOcip[2],gBc28UserQlwOcip[3],gBc28UserQlwPort);
		#endif
	}
	//Warn Mode Read Water Amount from Flash.
	AT24CXX_Read(ADDR_WNUM_RECORD,(uint8_t *)gBc28UserWaterDevNum,4);
	if((gBc28UserWaterDevNum[0] == 0xFF) && (gBc28UserWaterDevNum[1] == 0XFF) && (gBc28UserWaterDevNum[2] == 0XFF) && (gBc28UserWaterDevNum[3] == 0XFF)){
		memset(gBc28UserWaterDevNum, 0, sizeof(gBc28UserWaterDevNum));
		#ifdef HC32_LOG_DEBUG
		FIOT_LAB_LOG(LOG_DEBUG,"Water Num Not Setting\r");
		#endif			
	}else{
		#ifdef HC32_LOG_DEBUG
		FIOT_LAB_LOG(LOG_DEBUG,"Water Num : %02d%02d%02d%02d\r",gBc28UserWaterDevNum[0],gBc28UserWaterDevNum[1],gBc28UserWaterDevNum[2],gBc28UserWaterDevNum[3]);
		#endif	
	}		
	//Warn Mode Read Configure from Flash.
	if(AT24CXX_ReadOneByte(ADDR_IMWARN_RECORD) != 1){
		gBc35UserImmediatelyWarn = 0;
		#ifdef HC32_LOG_DEBUG
		FIOT_LAB_LOG(LOG_DEBUG,"Normol Warn Mode(default) : %d\r\n",gBc35UserImmediatelyWarn);
		#endif		
	}else{
		gBc35UserImmediatelyWarn = 1;
		#ifdef HC32_LOG_DEBUG
		FIOT_LAB_LOG(LOG_DEBUG,"Immediatelt Warn Mode : %d\r\n",gBc35UserImmediatelyWarn);
		#endif		
	}					
	if(AT24CXX_ReadOneByte(ADDR_DATAFREQUENCY_RECORD) != 0xff && AT24CXX_ReadOneByte(ADDR_DATAFREQUENCY_RECORD+1) != 0xff){
		gBc35UserSendDataFrequency = AT24CXX_ReadOneByte(ADDR_DATAFREQUENCY_RECORD)* 100 + AT24CXX_ReadOneByte(ADDR_DATAFREQUENCY_RECORD+1);
	}else{	
	}
	#ifdef HC32_LOG_DEBUG
	FIOT_LAB_LOG(LOG_DEBUG,"SendDataFrequency : %d Minute\r\n",gBc35UserSendDataFrequency);
	#endif			
}
/********************************************************************************
  ** \brief  LOG命令解析函数函数
  ** 
  ** @param  null
  ** 
  ** \retval Ok or Faile
******************************************************************************/
void Bc35UserLogMsgParser(void){
	uint8_t ret = 0;
	uint8_t index = FIOT_LAB_LOG_PARSER();
	switch(index)
	{
		case BC35STATUS_AT:	
				ret = Bc35UserAT();
				break;
		case BC35STATUS_VERSION:
				ret = Bc35UserGetVerison();			
				break;
		case BC35STATUS_REBOOT:
				ret = Bc35UserReboot();
				break;
		case BC35STATUS_BAND:
				ret = Bc35UserGetBand();
				break;
		case BC35STATUS_DATATIME:
				ret = Bc35UserGetDateTime();			
				break;
		case BC35STATUS_NUESTATUS:
		#ifdef HC32_L161_SUPPORTS
				ret = Bc35UserGetNueStatus();			
		#endif
		#ifdef HC32_BC28_SUPPORTS		
				ret = Bc28UserGetNueStatus();	
		#endif		
				break;
		case BC35STATUS_QCCID:
				ret = Bc35UserGetQccid();			
				break;
		case BC35STATUS_QIMEI:		
				ret = Bc35UserGetQimei();		
				break;
		case BC35STATUS_QIMSI:
				ret = Bc35UserGetQimsi();			
				break;
		case BC35STATUS_CGATT:
				ret = Bc35UserGetCgatt();			
				break;
		case BC35STATUS_CSQ:
				ret = BC35UserGetCsq();			
				break;
		case BC35STATUS_CEREG:
				ret = Bc35UserGetCeReg();			
				break;
		case 51://rebootDevice
			#ifdef HC32_LOG_SUPPORTS
			FIOT_LAB_LOG(LOG_FATAL,"DEV REBOOTING...\r\n");
			#endif
			NVIC_SystemReset();  //复位MCU				
		  break;
		case 52:
		#ifdef HC32_L161_SUPPORTS			
				ret = Bc35UserQlwServSend();
		#endif
		#ifdef HC32_BC28_SUPPORTS
				ret = Bc28UserQlwServSend();
		#endif		
			break;
		case 53:
				ret = Bc35UserSetCtm2mReg();
			break;
		case 54:
				ret = Bc35UserSetCtm2mUpData();
			break;
		case 55:
		FIOT_LAB_LOG(LOG_INFO,"Send Data OC\r\n");
		gBc35UserGetDataStatus = 0;
		gBc35UserSendDataStatus = 0;
		#ifdef HC32_L161_SUPPORTS			
				ret = Bc35UserQlwSendDataSend(OceanFlatSendMessId, DEV_CCODE_ALARMDATA, \
												DEV_ECODE_DEVDESTROY, 0);
		#endif
		#ifdef HC32_BC28_SUPPORTS
				ret = Bc28UserQlwSendDataSend(OceanFlatSendMessId, DEV_CCODE_ALARMDATA, \
												DEV_ECODE_DEVDESTROY, 0);
		#endif		
			break;
		case 56:
				ret = Bc35UserSetCtm2mEReg();
			break;
		case 57:
				ret = Bc35UserGetBcInfo();
			break;	
		case 58://Open BEEP
			HC32_BEEP_Hight();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Beep(PF03) Already Draw High(1)!\r\n");
			break;
		case 59://Close Beep
			HC32_BEEP_Low();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Beep(PF03) Already Draw Low(0)!\r\n");
			break;	
		case 60://Open NB Power
			HC32_NBPWR_Hight();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 NB PWR(PC11) Already Draw Hght(1)!\r\n");
			break;	
		case 61://Close NB Power
			HC32_NBPWR_Low();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 NB PWR(PC11) Already Draw Low(0)!\r\n");
			break;	
		case 62://Open SE Rst
			SE_REST_Hight();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 SE RST(PD12) Already Draw High(1)!\r\n");
			break;	
		case 63://Close SE Rst
			SE_REST_Low();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 SE RST(PD12) Already Draw Low(0)!\r\n");
			break;	
		case 64://Open NB Rst
			HC32_NBRST_Hight();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 NB RST(PC10) Already Draw High(1)!\r\n");
			break;	
		case 65://Close NB Rst
			HC32_NBRST_Low();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 NB RST(PC10) Already Draw Low(0)!\r\n");
			break;	
		case 66://Open WP 
			HC32_WP_Hight();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 WP(PF06) Already Draw High(1)!\r\n");
			break;	
		case 67://Close WP
			HC32_WP_Low();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 WP(PF06) Already Draw Low(0)!\r\n");
			break;	
		case 68://Open Bat 
			HC32_BATTERY_Hight();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Battery(PA15) Already Draw High(1)!\r\n");
			break;	
		case 69://Close Bat
			HC32_BATTERY_Low();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Battery(PA15) Already Draw Low(0)!\r\n");
			break;	
		case 70://Open Wake
			HC32_NBWAKE_Hight();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 NB WAKE(PD03) Already Draw High(1)!\r\n");
			break;	
		case 71://Close Wake
			HC32_NBWAKE_Low();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 NB WAKE(PD03) Already Draw Low(0)!\r\n");	
			break;	
		case 72://Open Pwm
			HC32_Valve_Open();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 PWM(PE8-9) Already Open!\r\n");	
			break;	
		case 73://Close Pwm
			HC32_Valve_Close();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 PWM(PE8-9) Already Close!\r\n");	
			break;	
		case 74://Check EEprom
			ret = AT24CXX_Check();
			if(ret)
				FIOT_LAB_LOG(LOG_DEBUG,"HC32 EEPROM(PB10-11) Already Check,Result:Fail\r\n");	
			else
				FIOT_LAB_LOG(LOG_DEBUG,"HC32 EEPROM(PB10-11) Already Check,Result:Succeed\r\n");				
			break;	
		case 75://Read Key
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Read Key(PC07) Level : %d\r\n",HC32_Read_Key());	
			break;	
		case 76://Open CLK
			SE_CLK_ON();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Se Clk Already Open!\r\n");	
			break;	
		case 77://Close CLK
			SE_CLK_OFF();
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Se Clk Already Close!\r\n");	
			break;	
		case 78://Read Battery 
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Read Battery Value: %f  BatteryLevel : %d!\r\n",BatteryObtain(),BatteryLevel());	
			break;	
		case 79://NB Enter Sleep
			Bc35UerSetPsmMode(1);
			#ifdef HC32_L161_SUPPORTS
			Bc35UserEnterSleep(0);
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Enter Sleep mode 0\r\n");			
			#endif
			break;	
		case 80://NB Get Pcnt
			FIOT_LAB_LOG(LOG_DEBUG,"HC32 Read Pcnt is %d,Ton is %d.%d\r\n",WaterFlowStatistics(),WaterReturnInt(),WaterReturnFloat());	
			break;	
		case 81://Modify IMEI	
			break;	
		case 82://Send Warn
			u8DeviceAlarm = 1;
			break;			
		}
		if(!ret && index < 58){
				#ifdef HC32_LOG_SUPPORTS				
				FIOT_LAB_LOG(LOG_FATAL,"ERROR\r\n");	
				#endif				
		}
}

static int Bc35UserGetNMGRSend(void){
    return Bc35UartUserSend(BC35_NMGR_READ);
}
static int Bc28UserGetNMGR(void){
    char *p = 0,*p1 = 0,*p2 = 0;
	char tmpbuf[64] = {0};
	char ret = 0;
	Bc35UserGetNMGRSend();
	delay1ms(200);
	memcpy(gBc35RecvBuf, gBc35UartRecvBuf, sizeof(gBc35UartRecvBuf));
    if(0 != (p = strstr((char *)gBc35RecvBuf, BC35_OK_REPLY))){
        if(0 != (p1 = strstr((char *)gBc35RecvBuf, ","))){
			//receive NNMI data	
			if((p = strstr((char *)gBc35RecvBuf, "\r\n")) != 0){
				p += strlen("\r\n");
				while(*p == '\r'||*p == '\n'||*p == 'N'||*p == '+'||*p == 'M'||*p == 'I' || *p == ':'||*p == ' ') p++;
				memset(gBc35Nngr.len,0,sizeof(gBc35Nngr.len));
				memcpy(gBc35Nngr.len, p, p1 - p);
				if(0 != (p2 = strstr((char *)p, "\r\n"))){
					if(*p1 == ',') p1++;
					memset(gBc35Nngr.rec,0,sizeof(gBc35Nngr.rec));
					memcpy(gBc35Nngr.rec, p1, p2 - p1);
					#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_DEBUG,"OceanFlat Rec:%s,%s\r", gBc35Nngr.len, gBc35Nngr.rec);
					#endif
					if(0 != strstr((char *)gBc35Nngr.rec, BC35_NNMI_RESPONSE)){
						#ifdef HC32_LOG_SUPPORTS
						FIOT_LAB_LOG(LOG_DEBUG,"OceanFlat Response!\r");
						#endif	
						gBc35UserSendDataRepetition = 0;
					}
					else
					{
						HexStrToAsciiStr(gBc35Nngr.rec,(char *)tmpbuf, sizeof(tmpbuf));	
						#ifdef HC32_LOG_DEBUG								
						FIOT_LAB_LOG(LOG_DEBUG,"Hander:%s-%d\r\n",tmpbuf,strlen(tmpbuf));
						#endif	
						//command manage
						ret = OceanConnect_cmd_parser((unsigned char *)tmpbuf,(uint16_t)gBc35Nngr.len);
						if(ret == 1){
							//cmd parser succeed
							#ifdef HC32_LOG_DEBUG								
							FIOT_LAB_LOG(LOG_DEBUG,"Oc Cmd Parser Succeed = %d\r\n",ret);
							#endif	
						}else{
							//cmd parser false
							#ifdef HC32_LOG_DEBUG								
							FIOT_LAB_LOG(LOG_DEBUG,"Oc Cmd Parser Faile = %d\r\n",ret);
							#endif										
						}
					}
					*p = 0;*p1 = 0;*p2 = 0;
					//logical handler
				}							
			}
        }
		return 1;
    }		
	return 0;
}

/********************************************************************************
  ** \brief  AT命令流程函数函数
  ** 
  ** @param  null
  ** 
  ** \retval 0:Faile  1:Succeed
******************************************************************************/
static void Bc35UserUartMsgSend(void){
    int ret = 0;
    Enum_BC35STATUS gBc35UserStatusListOnce[] = {
		BC35STATUS_VERSION,
		BC35STATUS_QIMEI,
		BC35STATUS_BAND,
		BC35STATUS_CGATT,
		BC35STATUS_QIMSI,		
		BC35STATUS_DATATIME,
		BC35STATUS_NUESTATUS,
		BC35STATUS_CSQ,
		BC35STATUS_EDRX,
		BC35STATUS_CPSMS,
		BC35STATUS_CFUN,
		BC35STATUS_CEREG,
		BC35STATUS_QCCID,		
		BC35STATUS_NNMI,
    };
	
	#ifdef HC32_BC28_SUPPORTS		
    Enum_BC35STATUS gBc35UserStatusList[] = {
        BC35STATUS_NMGR,
    };	
	#endif		
	
