fiotweixian/MeterWaterDevice/midware/HC32_NBIOT/hc32_bc35.c
	#ifdef HC_BC35_OCEANCONNECT_SUPPORT
	
	#ifdef HC32_L161_SUPPORTS
    Enum_BC35STATUS gBc35UserStatusListOceanConnet[] = {
		BC35STATUS_CGATT,
		BC35STATUS_DATATIME,
		BC35STATUS_NUESTATUS,
		BC35STATUS_NCDP,
		BC35STATUS_CTM2MREG,
		BC35STATUS_NMGS,
		BC35STATUS_CTM2MDEREG,
    };
	#endif
	
	#ifdef HC32_BC28_SUPPORTS	
    Enum_BC35STATUS gBc35UserStatusListOceanConnet[] = {
		BC35STATUS_CGATT,
		BC35STATUS_NNMI,		
		BC35STATUS_DATATIME,
		BC35STATUS_NUESTATUS,
		BC35STATUS_NCDP,
		BC35STATUS_NMGS,
    };
	#endif	
	
	#endif
	
    if(gBc35UserNextStatus == BC35STATUS_NONE){
		//小于状态流程gBc35UserStatusListOnce
        if(gBc35UserStatusIndex < HcArraySize(gBc35UserStatusListOnce)){
            gBc35UserNextStatus = gBc35UserStatusListOnce[gBc35UserStatusIndex];
		#ifdef HC_BC35_OCEANCONNECT_SUPPORT
		//小于状态流程gBc35UserStatusListOceanConnet				
		}else if(gBc35UserStatusIndex < (HcArraySize(gBc35UserStatusListOnce) + HcArraySize(gBc35UserStatusList))){
            gBc35UserNextStatus = gBc35UserStatusList[gBc35UserStatusIndex - HcArraySize(gBc35UserStatusListOnce)];
        }else if(gBc35UserStatusIndex < (HcArraySize(gBc35UserStatusListOnce) + HcArraySize(gBc35UserStatusList) + HcArraySize(gBc35UserStatusListOceanConnet))){
            gBc35UserNextStatus = gBc35UserStatusListOceanConnet[gBc35UserStatusIndex - HcArraySize(gBc35UserStatusListOnce) - HcArraySize(gBc35UserStatusList)];		
		#endif
		}else{//超过最大值
			gBc35UserStatusIndex = 0;
			gBc35UserNextStatus = gBc35UserStatusListOnce[gBc35UserStatusIndex];				
		}			
				
		//状态遍历
		gBc35UserStatusIndex++;		
				
		#ifdef HC_BC35_OCEANCONNECT_SUPPORT
		if(u8DeviceAlarm == 1 || u8DeviceWarning == 1 || u8DeviceOverCurrent == 1){//日上报数据
		//执行完成 		
		if(gBc35UserStatusIndex >= (HcArraySize(gBc35UserStatusListOnce) + HcArraySize(gBc35UserStatusList) + HcArraySize(gBc35UserStatusListOceanConnet))){
				gBc35UserStatusIndex = HcArraySize(gBc35UserStatusListOnce);
				gBc35UserQlwConnectStatus = 0;
			}					
		}else
		if(gBc35UserStatusIndex >= (HcArraySize(gBc35UserStatusListOnce) + HcArraySize(gBc35UserStatusList))){
			gBc35UserStatusIndex = HcArraySize(gBc35UserStatusListOnce);
		}
		#endif		
	}
		
	switch(gBc35UserNextStatus){
		case BC35STATUS_REBOOT:
			ret = Bc35UserReboot();
			break;
		case BC35STATUS_VERSION:
			ret = Bc35UserGetVerison();
			break;
		case BC35STATUS_DATATIME:
			ret = Bc35UserGetDateTime();	
			break;
		case BC35STATUS_NUESTATUS:
			ret = Bc28UserGetNueStatus();		
			break;
		case BC35STATUS_QCCID:
			ret = Bc35UserGetQccid();
			break;
		case BC35STATUS_BAND:
			ret = Bc35UserGetBand();
			break;
		case BC35STATUS_QIMEI:
			ret = Bc35UserGetQimei();
			break;
		case BC35STATUS_QIMSI:
			ret = Bc35UserGetQimsi();
			break;
		case BC35STATUS_CGATT:
			ret = Bc35UserGetCgatt();
			break;
		case BC35STATUS_CSQ:
			ret = BC35UserGetCsq();
			break;
		case BC35STATUS_CEREG:
			ret = Bc35UserGetCeReg();
			break;
		case BC35STATUS_EDRX:
			ret = Bc35UserGeteDRX();
			break;
		case BC35STATUS_CPSMS:
			ret = Bc35UserGetPsmMode();
			break;
		case BC35STATUS_CFUN:
			ret = Bc35UserGetCfun();
			break;
		case BC35STATUS_NNMI:
			ret = Bc35UserSetNnmi(BC35_NNMI_TWO);
			break;
			#ifdef HC_BC35_OCEANCONNECT_SUPPORT
		case BC35STATUS_NCDP:
			#ifdef HC32_BC28_SUPPORTS
			ret = Bc28UserQlwServSend();
			#endif		
			break;		
		case BC35STATUS_CTM2MREG:
			ret = Bc35UserSetCtm2mReg();
			break;
		case BC35STATUS_CTM2MUPDATE:
			ret = Bc35UserSetCtm2mUpData();
			break;
		case BC35STATUS_NMGS:		
			if(u8DeviceAlarm == 1){
			#ifdef HC32_BC28_SUPPORTS
				ret = Bc28UserQlwSendDataSend(OceanFlatSendMessId, DEV_CCODE_METERDATA, \
											DEV_ECODE_NORMAL, 0);
			#endif
			}else if(u8DeviceWarning == 1){
			#ifdef HC32_BC28_SUPPORTS
				ret = Bc28UserQlwSendDataSend(OceanFlatSendMessId, DEV_CCODE_ALARMDATA, \
											DEV_ECODE_DEVDESTROY, 0);
			#endif
			}else if(u8DeviceOverCurrent == 1){
			#ifdef HC32_BC28_SUPPORTS
				ret = Bc28UserQlwSendDataSend(OceanFlatSendMessId, DEV_CCODE_ALARMDATA, \
											DEV_ECODE_OVERCURRENT, 0);
			#endif			
			}				
			break;
		case BC35STATUS_CTM2MDEREG:	
			FIOT_LAB_LOG(LOG_FATAL,"Bc35UserSetCtm2mReg\r");					
			ret = Bc35UserSetCtm2mEReg();
			break;
		#endif
		case BC35STATUS_NMGR:
			ret = Bc28UserGetNMGR();
			break;		
		case BC35STATUS_SETEDRX:
			ret = Bc35UserSeteDRX(BC35_EDRX_ENABLE,BC35_EDRX_NBS1,BC35_EDRX_20P48SEC);
			break;
		case BC35STATUS_SETCPSMS:
			ret = Bc35UerSetPsmMode(BC35_PSM_MODE_ENABLE);
			break;
		case BC35STATUS_SETCFUN:
			ret = Bc35UserSetCfun(1);
			break;
		case BC35STATUS_SETCGATT:
			ret = Bc35UerSetCgatt(1);
			break;
		default:
			break;
	}
		
    if(ret){//send ok clear status
		if(gBc35UserNextStatus != BC35STATUS_BUSY){
			gBc35UserGetDataError = 0;
			gBc35UserNextStatus = BC35STATUS_NONE;
		}
		if(gBc35UserGetDataStatus){
			LpTimer_Disable();
			gBc35UserGetDataStatus = 0;
			gLptimSecRecord = 0;			
		}
    }
	else //Return error
	{
//		
		gBc35UserWaitResponse = 1;
//		
//		//Start Lptimer
		LpTimer_Enable();
//		
		if(gBc35UserGetDataStatus == 2){
			
			if(u8DeviceWarning == 1)
				u8DeviceWarning = 0;
			
			if(u8DeviceAlarm == 1)
				u8DeviceAlarm = 0;
			
			if(u8DeviceOverCurrent == 1)
				u8DeviceOverCurrent = 0;
			
			gBc35UserNextStatus = BC35STATUS_NONE;
			if(gBc35UserStatusIndex < (HcArraySize(gBc35UserStatusListOnce)))
				gBc35UserStatusIndex = 0;
			else if(gBc35UserStatusIndex < (HcArraySize(gBc35UserStatusListOnce) + HcArraySize(gBc35UserStatusListOceanConnet)))
				gBc35UserStatusIndex = HcArraySize(gBc35UserStatusListOnce);			
		}else{
			//get NB data failed
			gBc35UserGetDataStatus = 1;//AT CMD Send Faile
		}
	}
}	
/******************************************************************************
  ** \brief  异常处理函数
  ** 
  ** @param  NULL
  ** 
  ** \retval NULL
******************************************************************************/
void Bc35UserExceptionHandle(void){
	if((gBc35UserSendDataRepetition != 0 || gBc35UserGetDataError != 0)){
		FIOT_LAB_LOG(LOG_DEBUG,"-------------ExceptionHandle:%d %d-------------\r\n",gBc35UserSendDataRepetition,gBc35UserGetDataError);								
		if(gBc35UserSendDataRepetition != 0 && gBc35UserSendDataRepetition <= 3){
			u8DeviceAlarm = 1;
			FIOT_LAB_LOG(LOG_DEBUG,"Repetition Send Data OC\r\n");
		}else if(gBc35UserGetDataError != 0 && gBc35UserGetDataError <= 3){
			u8DeviceAlarm = 1;
			FIOT_LAB_LOG(LOG_DEBUG,"Repetition Send AT CMD \r\n");				
		}else{
			//发送N次不成功,进入补包
			if(gBc35UserSendDataRepetition >= 3){
				gBc35UserSendDataRepetition = 0;
				FIOT_LAB_LOG(LOG_DEBUG,"Repetition Send Data OC n time\r\n");
			}
			if(gBc35UserGetDataError >= 3){
				gBc35UserGetDataError = 0;
				FIOT_LAB_LOG(LOG_DEBUG,"Repetition Send AT CMD n time\r\n");												
			}
			gBc35UserLeakPackage++;//补包开始
		}
	}		
}
/******************************************************************************
  ** \brief  OC平台接收命令函数
  ** 
  ** @param  null
  ** 
  ** \retval Ok or Faile
******************************************************************************/
void Bc35UartUserHandle(void){
	if(gBc35UserGetDataStatus != 2 && gBc35UserSendDataStatus != 2)
		Bc35UserUartMsgSend();
	//send data OC,handle OC's cmd.
	if(gBc35UserWaitResponse == 1){	
		#ifdef HC32_LOG_SUPPORTS				
		//FIOT_LAB_LOG(LOG_FATAL,"Wait Record Time : %d %d %d!\r",gLptimSecRecord,gBc35UserReceiveCmdFromOc,u8DeviceAlarm);	
		#endif
		//wait 20s time
		if((gLptimSecRecord >= 10 && (gBc35UserSendDataStatus != 0 || gBc35UserGetDataStatus != 0))){
			if(gBc35UserReceiveCmdFromOc == 0){	//AT Send Time Out
				LpTimer_Disable();				//Stop Lptimer
				gBc35UserWaitResponse = 0;		//clear wait 20s flag	
				#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_FATAL,"AT Send End\r");
				#endif	
				if(gBc35UserGetDataStatus){	
					//gBc35UserStatusIndex = 0;//重新发送
					u8DeviceAlarm = 0;
					gBc35UserGetDataError ++;//发送AT命令未成功,进入补发操作
					gBc35UserGetDataStatus = 2;//time out Send AT
					#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_FATAL,"AT Send Faile :%d %d\r",gBc35UserGetDataError,gBc35UserGetDataStatus);
					#endif					
				}					
			}else if(gBc35UserReceiveCmdFromOc < 1){
				gBc35UserReceiveCmdFromOc++;
			}else if(gBc35UserReceiveCmdFromOc >= 1){	
				gBc35UserReceiveCmdFromOc = 0;
				LpTimer_Disable();				
				gBc35UserWaitResponse = 0;		//clear wait 20s flag
				if(gBc35UserSendDataStatus){
					u8DeviceAlarm = 0;//Cancel this delivery
					gBc35UserSendDataStatus = 2;//time out Send AT
					u8DeviceDeepSleep = 1;//enter sleep
				}				
				#ifdef HC32_LOG_SUPPORTS
					FIOT_LAB_LOG(LOG_FATAL,"SendData End\r");
				#endif				
			}
			gLptimSecRecord = 0;				//clear time count	
		}
	}	
}
/******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/












